{
	"FormatVersion": 2,
	"Namespace": "",
	"Children": [
		{
			"Source": {
				"Text": "(0 upgradeable)"
			},
			"Translation": {
				"Text": "(0 для оновлення)"
			},
			"Key": "3CEFA89C415D47DF87C953A4F5A22837"
		},
		{
			"Source": {
				"Text": "+"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "BE9D645D4352A41A16C3D0A5F1F62C94"
		},
		{
			"Source": {
				"Text": "+"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "F8E467094A594E5C21A542B94D14B1E6"
		},
		{
			"Source": {
				"Text": "+"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "3739407645161CDED5901EACEAEE5915"
		},
		{
			"Source": {
				"Text": "0"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "72BCC75B46EB14C88FA0CB8AFFE0ACFA"
		},
		{
			"Source": {
				"Text": "Adjust Current Axis"
			},
			"Translation": {
				"Text": "Налаштувати поточну вісь"
			},
			"Key": "0F38693943C29DCD75F8C1B27871C5B8"
		},
		{
			"Source": {
				"Text": "Adjust Recipe"
			},
			"Translation": {
				"Text": "Налаштувати рецепт"
			},
			"Key": "FF3BF8944642F2DEE83E0685A53303EE"
		},
		{
			"Source": {
				"Text": "Adjust grid X-axis (forward/backward)"
			},
			"Translation": {
				"Text": "Налаштувати вісь X сітки (вперед/назад)"
			},
			"Key": "15E8B3EA40E8AC8A1E8E818BA03670E5"
		},
		{
			"Source": {
				"Text": "Adjust grid Y-axis (left/right)"
			},
			"Translation": {
				"Text": "Налаштувати вісь Y сітки (ліворуч/праворуч)"
			},
			"Key": "311FCC0E4AB23FE12C19BA94A560D1FB"
		},
		{
			"Source": {
				"Text": "Adjust grid Z-axis (up/down)"
			},
			"Translation": {
				"Text": "Налаштувати вісь Z сітки (вгору/вниз)"
			},
			"Key": "ADFEA69944158AB689D01EB52BA2A425"
		},
		{
			"Source": {
				"Text": "Adjust sideways offset for grid items"
			},
			"Translation": {
				"Text": "Налаштувати бічне зміщення для елементів сітки"
			},
			"Key": "7945CB1F4E10CE8044DCBF8DC47322E1"
		},
		{
			"Source": {
				"Text": "Adjust spacing for currently selected axis"
			},
			"Translation": {
				"Text": "Налаштувати відстань для поточно вибраної осі"
			},
			"Key": "F10D935E43878D99436DE5979A4E7EFD"
		},
		{
			"Source": {
				"Text": "Adjust step height for layers"
			},
			"Translation": {
				"Text": "Налаштувати висоту сходинки для шарів"
			},
			"Key": "4878AB2843890693F30F2BBA496DCCE8"
		},
		{
			"Source": {
				"Text": "Always (0)"
			},
			"Translation": {
				"Text": "Завжди (0)"
			},
			"Key": "DFC6C7C441EFDC29C8E28F8F68C31EC1"
		},
		{
			"Source": {
				"Text": "Anchor: Aim at a belt, pipe, or pole"
			},
			"Translation": {
				"Text": "Якір: Наведіть на стрічку, трубу або стовп"
			},
			"Key": "7C1BBA564FF13BA590D8A89C48E3F2C8"
		},
		{
			"Source": {
				"Text": "Auto"
			},
			"Translation": {
				"Text": "Авто"
			},
			"Key": "B7D7520E4A0B332ED9D87DBC994D5379"
		},
		{
			"Source": {
				"Text": "Auto"
			},
			"Translation": {
				"Text": "Авто"
			},
			"Key": "29B5665E4347B8A528480EA82ED201BE"
		},
		{
			"Source": {
				"Text": "Auto (0)"
			},
			"Translation": {
				"Text": "Авто (0)"
			},
			"Key": "40EADFF242CC6D8E10A4EDB6D777D2BC"
		},
		{
			"Source": {
				"Text": "Auto (0)"
			},
			"Translation": {
				"Text": "Авто (0)"
			},
			"Key": "9852395F409F9C751F989FA1748BFA16"
		},
		{
			"Source": {
				"Text": "Auto (0)"
			},
			"Translation": {
				"Text": "Авто (0)"
			},
			"Key": "A863449D4ED1EF98FD3531A57C03A83B"
		},
		{
			"Source": {
				"Text": "Auto 2D"
			},
			"Translation": {
				"Text": "Авто 2D"
			},
			"Key": "C24F4DC44DCA9C1FB249098A51A3B982"
		},
		{
			"Source": {
				"Text": "Auto 2D"
			},
			"Translation": {
				"Text": "Авто 2D"
			},
			"Key": "A9F4FD7C4ADCBE49DE0631A2046B8C32"
		},
		{
			"Source": {
				"Text": "CANCEL"
			},
			"Translation": {
				"Text": "СКАСУВАТИ"
			},
			"Key": "9423B8A2450BD3341A377D9BD4CCD62B"
		},
		{
			"Source": {
				"Text": "Cancel"
			},
			"Translation": {
				"Text": "Скасувати"
			},
			"Key": "1754F7834BF1389234CDF2A4813856D4"
		},
		{
			"Source": {
				"Text": "Classic (2)"
			},
			"Translation": {
				"Text": "Класична (2)"
			},
			"Key": "337DE321404C52EA519126A27AD16256"
		},
		{
			"Source": {
				"Text": "Close"
			},
			"Translation": {
				"Text": "Закрити"
			},
			"Key": "CB15E1A74E71CFAEDB6CA3AA8994C227"
		},
		{
			"Source": {
				"Text": "Configure Smart! scaling, visualization, and HUD settings"
			},
			"Translation": {
				"Text": "Налаштувати масштабування, візуалізацію та HUD Smart!"
			},
			"Key": "98E28A8E4D25D9D8BCD4C08EC6A98DE6"
		},
		{
			"Source": {
				"Text": "Core Smart! Foundations settings for HUD display and default scale values"
			},
			"Translation": {
				"Text": "Основні налаштування Smart! Foundations для відображення HUD та значень масштабу за замовчуванням"
			},
			"Key": "FD8B2189447F09294CBA09A02293BB9C"
		},
		{
			"Source": {
				"Text": "Cross Splitters/Mergers"
			},
			"Translation": {
				"Text": "Через розділювачі/об'єднувачі"
			},
			"Key": "7A593AF64E9BB01288D106BC6229CBF9"
		},
		{
			"Source": {
				"Text": "Cross Storage Containers"
			},
			"Translation": {
				"Text": "Через контейнери зберігання"
			},
			"Key": "5938A49142B563B4FB59E985E9AE1841"
		},
		{
			"Source": {
				"Text": "Cross Train Platforms"
			},
			"Translation": {
				"Text": "Через залізничні платформи"
			},
			"Key": "D042222F4CF5B96FB75D6AB15DFD0645"
		},
		{
			"Source": {
				"Text": "Curve"
			},
			"Translation": {
				"Text": "Крива"
			},
			"Key": "60DE1CEC4B85C0CC72203CBF61E7568D"
		},
		{
			"Source": {
				"Text": "Curve"
			},
			"Translation": {
				"Text": "Крива"
			},
			"Key": "C37B40874B51E0F5798841AA27981362"
		},
		{
			"Source": {
				"Text": "Curve"
			},
			"Translation": {
				"Text": "Крива"
			},
			"Key": "2E5F43054D0239D4BAC0F4862CB459FB"
		},
		{
			"Source": {
				"Text": "Cycle Axis Mode"
			},
			"Translation": {
				"Text": "Циклічно перемикати режим осі"
			},
			"Key": "348DAE9A4D32A65A01DF6A8106D161BC"
		},
		{
			"Source": {
				"Text": "Cycle through X → Y → Z axes"
			},
			"Translation": {
				"Text": "Циклічно перемикати осі X → Y → Z"
			},
			"Key": "9C14E6F8447F242BFBB485BD8E31A5F3"
		},
		{
			"Source": {
				"Text": "Dark (1)"
			},
			"Translation": {
				"Text": "Темна (1)"
			},
			"Key": "15B881014DC7C163FCB1419FB255A0EC"
		},
		{
			"Source": {
				"Text": "Decrease value for active feature (scaling, spacing, steps, or stagger)"
			},
			"Translation": {
				"Text": "Зменшити значення для активної функції (масштабування, відстань, сходинки або зміщення)"
			},
			"Key": "3BECA57E4ACCC555B29B23AC5605DDCD"
		},
		{
			"Source": {
				"Text": "Default"
			},
			"Translation": {
				"Text": "За замовчуванням"
			},
			"Key": "D16C08E24764156DC1CBDAB0287C8627"
		},
		{
			"Source": {
				"Text": "Default (0)"
			},
			"Translation": {
				"Text": "За замовчуванням (0)"
			},
			"Key": "A6A1DA99437171CC3D6B8C9E2918CEE0"
		},
		{
			"Source": {
				"Text": "Detect Issues"
			},
			"Translation": {
				"Text": "Виявити проблеми"
			},
			"Key": "9C1531E24044FDC579C089A23F379274"
		},
		{
			"Source": {
				"Text": "Entire Map"
			},
			"Translation": {
				"Text": "Вся карта"
			},
			"Key": "BE3FB1994C8451039886D1829DD59B06"
		},
		{
			"Source": {
				"Text": "Estimated Cost"
			},
			"Translation": {
				"Text": "Орієнтовна вартість"
			},
			"Key": "74176A6A4B5B3CE8A9A4BA8F752D804C"
		},
		{
			"Source": {
				"Text": "Estimated Cost"
			},
			"Translation": {
				"Text": "Орієнтовна вартість"
			},
			"Key": "173D524544632CCDED043A9E3F4F7CC3"
		},
		{
			"Source": {
				"Text": "Family Name Mk.1"
			},
			"Translation": {
				"Text": "Назва сімейства Mk.1"
			},
			"Key": "BEFE3D9D4EA76F0E2C34198C02E30A1E"
		},
		{
			"Source": {
				"Text": "Grid Total: 1 objects"
			},
			"Translation": {
				"Text": "Всього сітка: 1 об'єкт"
			},
			"Key": "7ECCEB924559BAD3A1844C80D4581EAE"
		},
		{
			"Source": {
				"Text": "HUD Scale"
			},
			"Translation": {
				"Text": "Масштаб HUD"
			},
			"Key": "9E038900477F0B65A5A64E91AB5C00F0"
		},
		{
			"Source": {
				"Text": "High Contrast (3)"
			},
			"Translation": {
				"Text": "Високий контраст (3)"
			},
			"Key": "0B68620A45C29BCF2BD3D390E9C6440C"
		},
		{
			"Source": {
				"Text": "Hold to activate progressive layering (modifier key)"
			},
			"Translation": {
				"Text": "Утримуйте для активації прогресивного нашарування (клавіша-модифікатор)"
			},
			"Key": "93C024D64433A5447D2C0396B3C5CB33"
		},
		{
			"Source": {
				"Text": "Hold to activate rotation transform mode (modifier key)"
			},
			"Translation": {
				"Text": "Утримуйте для активації режиму обертання (клавіша-модифікатор)"
			},
			"Key": "2B909A3E4443898FEB06568A0618C52A"
		},
		{
			"Source": {
				"Text": "Hold to activate sideways offset (modifier key)"
			},
			"Translation": {
				"Text": "Утримуйте для активації бічного зміщення (клавіша-модифікатор)"
			},
			"Key": "E7D5F1A145882159A49EE89DEAA01EF5"
		},
		{
			"Source": {
				"Text": "Hold to activate spacing (modifier key)"
			},
			"Translation": {
				"Text": "Утримуйте для активації відстані (клавіша-модифікатор)"
			},
			"Key": "2878874049B6D5EE0A5D6D9B48259F72"
		},
		{
			"Source": {
				"Text": "Hold to scale X-axis. Combine with Y modifier to scale Z-axis."
			},
			"Translation": {
				"Text": "Утримуйте для масштабування осі X. Поєднайте з модифікатором Y для масштабування осі Z."
			},
			"Key": "9AE7D23346D4BB5B0192848D8291920C"
		},
		{
			"Source": {
				"Text": "Hold to scale Y-axis. Combine with X modifier to scale Z-axis."
			},
			"Translation": {
				"Text": "Утримуйте для масштабування осі Y. Поєднайте з модифікатором X для масштабування осі Z."
			},
			"Key": "FA69B4C54C1F9AC00819708F1BD00666"
		},
		{
			"Source": {
				"Text": "Horiz→Vert"
			},
			"Translation": {
				"Text": "Гор.→Верт."
			},
			"Key": "A70A70BC46CB9221B4A7618D9D344FCD"
		},
		{
			"Source": {
				"Text": "Horiz→Vert"
			},
			"Translation": {
				"Text": "Гор.→Верт."
			},
			"Key": "E0D5AEF140C1253876F13FB56301E909"
		},
		{
			"Source": {
				"Text": "Hypertube Auto-Connect:"
			},
			"Translation": {
				"Text": "Авто-з'єднання гіпертруб:"
			},
			"Key": "7D70E1B54E59E0072AA18581782CA4A0"
		},
		{
			"Source": {
				"Text": "Increase value for active feature (scaling, spacing, steps, or stagger)"
			},
			"Translation": {
				"Text": "Збільшити значення для активної функції (масштабування, відстань, сходинки або зміщення)"
			},
			"Key": "1BCE444B43095B0D655193A1B416CBBD"
		},
		{
			"Source": {
				"Text": "Large Grid Warning"
			},
			"Translation": {
				"Text": "Попередження про велику сітку"
			},
			"Key": "33C84A48437DD1E5D1CF0AAD223DC813"
		},
		{
			"Source": {
				"Text": "Minimal (4)"
			},
			"Translation": {
				"Text": "Мінімальна (4)"
			},
			"Key": "A08F54F64F8642B9E7F8F1AA30D2B869"
		},
		{
			"Source": {
				"Text": "Mk1 (1)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "B67A2B1049D6C022FFE45AA3C7E91E0D"
		},
		{
			"Source": {
				"Text": "Mk1 (1)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "80ADD8BF4E442F2608D92FB8ECD49CC2"
		},
		{
			"Source": {
				"Text": "Mk2 (2)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "7A7B62144F20B0B73ABCD8B643EED6A1"
		},
		{
			"Source": {
				"Text": "Mk2 (2)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "6587C0CB460666BD6FC98BB018890DC5"
		},
		{
			"Source": {
				"Text": "Mk3 (3)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "438320444C8158C55C66F08F8D53EBD5"
		},
		{
			"Source": {
				"Text": "Mk4 (4)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "C0E174744867FC71F8E879B5AE7D69EE"
		},
		{
			"Source": {
				"Text": "Mk5 (5)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "C08F8647484002CCC38A78938534A251"
		},
		{
			"Source": {
				"Text": "Mk6 (6)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "31D1020F4EA86C6B0532A3916E9533CD"
		},
		{
			"Source": {
				"Text": "Monochrome (5)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "8E24BA32430E1A670137ABA048747BB8"
		},
		{
			"Source": {
				"Text": "Network"
			},
			"Translation": {
				"Text": "Мережа"
			},
			"Key": "09B266E74168D79CC01A54B6220782CC"
		},
		{
			"Source": {
				"Text": "Never (2)"
			},
			"Translation": {
				"Text": "Ніколи (2)"
			},
			"Key": "E9350DEF466B0A2E9F7FBDB9FA947A97"
		},
		{
			"Source": {
				"Text": "Noodle"
			},
			"Translation": {
				"Text": "Гнучка"
			},
			"Key": "928114D446D78C041AEF5D88157821E9"
		},
		{
			"Source": {
				"Text": "Noodle"
			},
			"Translation": {
				"Text": "Гнучка"
			},
			"Key": "2BBD2D8A4804BE82F72DB0B091876974"
		},
		{
			"Source": {
				"Text": "Not saved"
			},
			"Translation": {
				"Text": "Не збережено"
			},
			"Key": "CDF7639140F228F3095085B61DF1FC1A"
		},
		{
			"Source": {
				"Text": "Once (1)"
			},
			"Translation": {
				"Text": "Один раз (1)"
			},
			"Key": "A1723C3742687518D3D7FAB8769C4F43"
		},
		{
			"Source": {
				"Text": "Press REFRESH to scan for upgradeable buildings. Press ESC or K to close."
			},
			"Translation": {
				"Text": "Натисніть ОНОВИТИ для сканування будівель для оновлення. Натисніть ESC або K, щоб закрити."
			},
			"Key": "66C35E014DB7009BE3B924A85F570FD7"
		},
		{
			"Source": {
				"Text": "Press to clear active recipe"
			},
			"Translation": {
				"Text": "Натисніть, щоб очистити активний рецепт"
			},
			"Key": "790FF28E4D98D951C6AE27B8A147F50F"
		},
		{
			"Source": {
				"Text": "REFRESH"
			},
			"Translation": {
				"Text": "ОНОВИТИ"
			},
			"Key": "1CBF9AC24AB88ED704D8B89C23669BF7"
		},
		{
			"Source": {
				"Text": "Radius"
			},
			"Translation": {
				"Text": "Радіус"
			},
			"Key": "1CBE81654BEC06C4EE4D2F9B77C6823C"
		},
		{
			"Source": {
				"Text": "Radius (m):"
			},
			"Translation": {
				"Text": "Радіус (м):"
			},
			"Key": "32F87FF84A2C859EEF06EDA73BD50D90"
		},
		{
			"Source": {
				"Text": "Ready"
			},
			"Translation": {
				"Text": "Готово"
			},
			"Key": "FD2BEAF2493FD288E0C03FB923FE3E94"
		},
		{
			"Source": {
				"Text": "Recipe Mode"
			},
			"Translation": {
				"Text": "Режим рецепта"
			},
			"Key": "310A5EFE4224B829F9BA469562A68951"
		},
		{
			"Source": {
				"Text": "Recipe Up/Down"
			},
			"Translation": {
				"Text": "Рецепт вгору/вниз"
			},
			"Key": "F87C5DEE489864EDB5D02386C86E62CF"
		},
		{
			"Source": {
				"Text": "Repair All Issues"
			},
			"Translation": {
				"Text": "Виправити всі проблеми"
			},
			"Key": "70622324402CD200612E9395164CE150"
		},
		{
			"Source": {
				"Text": "Repair result will appear here"
			},
			"Translation": {
				"Text": "Тут з'явиться результат ремонту"
			},
			"Key": "C6DDD93A4DEF142BBA1E08BBE2381F1B"
		},
		{
			"Source": {
				"Text": "Rotation Mode"
			},
			"Translation": {
				"Text": "Режим обертання"
			},
			"Key": "E3CA9AD8424D9B1B3B996C97C1F70A61"
		},
		{
			"Source": {
				"Text": "Route mouse wheel input to the active Smart! feature (scaling, spacing, steps, or stagger)"
			},
			"Translation": {
				"Text": "Спрямувати ввід коліщатка миші на активну функцію Smart! (масштабування, відстань, сходинки або зміщення)"
			},
			"Key": "FA953BD649A5AEE3F69CB7AFE9E2A43A"
		},
		{
			"Source": {
				"Text": "Routing:"
			},
			"Translation": {
				"Text": "Маршрутизація:"
			},
			"Key": "F9CB428247FA00F2916066950E42FA87"
		},
		{
			"Source": {
				"Text": "Run Detect to see results"
			},
			"Translation": {
				"Text": "Запустіть Виявити, щоб побачити результати"
			},
			"Key": "96E044FE4DDABD241B0483A89D209A2C"
		},
		{
			"Source": {
				"Text": "SCAN NETWORK"
			},
			"Translation": {
				"Text": "СКАНУВАТИ МЕРЕЖУ"
			},
			"Key": "827BDCB04E7D02296EA3E880D6C24DC3"
		},
		{
			"Source": {
				"Text": "Save New Preset"
			},
			"Translation": {
				"Text": "Зберегти новий пресет"
			},
			"Key": "DD0B98B04A427071B009D7BAA464B531"
		},
		{
			"Source": {
				"Text": "Scale Forward/Back"
			},
			"Translation": {
				"Text": "Масштабувати вперед/назад"
			},
			"Key": "7F2E5ED1421D2CB422D39B96E7FEFA25"
		},
		{
			"Source": {
				"Text": "Scale Left/Right"
			},
			"Translation": {
				"Text": "Масштабувати ліворуч/праворуч"
			},
			"Key": "A65B455D41D3967FE018129E6F8D99BC"
		},
		{
			"Source": {
				"Text": "Scale Up/Down"
			},
			"Translation": {
				"Text": "Масштабувати вгору/вниз"
			},
			"Key": "D62D58CF4AFE88D8DE519488D31F424F"
		},
		{
			"Source": {
				"Text": "Scale X Modifier"
			},
			"Translation": {
				"Text": "Модифікатор масштабу X"
			},
			"Key": "B433CC5C466EDDBF3105FA829F9B12D5"
		},
		{
			"Source": {
				"Text": "Scale Y Modifier"
			},
			"Translation": {
				"Text": "Модифікатор масштабу Y"
			},
			"Key": "FECC44E2411C81715010F7B2FAD081E6"
		},
		{
			"Source": {
				"Text": "Scan"
			},
			"Translation": {
				"Text": "Сканування"
			},
			"Key": "1322786544407AA4F8ED1B8190F76D9F"
		},
		{
			"Source": {
				"Text": "Scan network to see costs"
			},
			"Translation": {
				"Text": "Скануйте мережу для перегляду витрат"
			},
			"Key": "E66C9E5840CD757371D1B2A26B0937F7"
		},
		{
			"Source": {
				"Text": "Select items to see costs"
			},
			"Translation": {
				"Text": "Виберіть елементи для перегляду витрат"
			},
			"Key": "9E972DC647E3D424CFE890B235FB1EE3"
		},
		{
			"Source": {
				"Text": "Share"
			},
			"Translation": {
				"Text": "Поділитися"
			},
			"Key": "6B9892D145A9E8A2054CEBAEF0A6B4E5"
		},
		{
			"Source": {
				"Text": "Show Direction Arrows (can be overridden)"
			},
			"Translation": {
				"Text": "Показати стрілки напрямку (можна змінити)"
			},
			"Key": "EA82618C44B70702397E7E97036E946B"
		},
		{
			"Source": {
				"Text": "Show/hide axis direction arrows"
			},
			"Translation": {
				"Text": "Показати/сховати стрілки напрямку осей"
			},
			"Key": "78E37EDB4BEB48A04A5139AC6A0C614D"
		},
		{
			"Source": {
				"Text": "Smart Restore"
			},
			"Translation": {
				"Text": "Smart Відновлення"
			},
			"Key": "F506AD1F41CF8A81A27FC0A480EAE8B8"
		},
		{
			"Source": {
				"Text": "Smart! Configuration"
			},
			"Translation": {
				"Text": "Smart! Налаштування"
			},
			"Key": "7BAE3F3D4FEAEB14DC15CCBAC6FA6820"
		},
		{
			"Source": {
				"Text": "Smart! Foundations"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "97E5935349503B2191BFE4B385BC7AB3"
		},
		{
			"Source": {
				"Text": "Smart! Grid Scaling"
			},
			"Translation": {
				"Text": "Smart! Масштабування сітки"
			},
			"Key": "51EB9D9A495D641249A89FA0BD6F76B3"
		},
		{
			"Source": {
				"Text": "Smart! Grid Scaling"
			},
			"Translation": {
				"Text": "Smart! Масштабування сітки"
			},
			"Key": "53A77D7341E0BB96E67D9287BEF26C24"
		},
		{
			"Source": {
				"Text": "Smart! Grid Scaling"
			},
			"Translation": {
				"Text": "Smart! Масштабування сітки"
			},
			"Key": "62C6E10A41335FE94A371DB0EA31B799"
		},
		{
			"Source": {
				"Text": "Smart! Grid Scaling"
			},
			"Translation": {
				"Text": "Smart! Масштабування сітки"
			},
			"Key": "B4E7FC1B4C29E5780A005DACF4F6605B"
		},
		{
			"Source": {
				"Text": "Smart! Grid Scaling"
			},
			"Translation": {
				"Text": "Smart! Масштабування сітки"
			},
			"Key": "331CFA504EADB43C56B9C1AF41012E2F"
		},
		{
			"Source": {
				"Text": "Smart! Grid Scaling"
			},
			"Translation": {
				"Text": "Smart! Масштабування сітки"
			},
			"Key": "B8C9B67949C7644C3AE6519EBC26464D"
		},
		{
			"Source": {
				"Text": "Smart! Interface"
			},
			"Translation": {
				"Text": "Smart! Інтерфейс"
			},
			"Key": "F484CB0045E1F6610752E19D98C01DFE"
		},
		{
			"Source": {
				"Text": "Smart! Panel"
			},
			"Translation": {
				"Text": "Smart! Панель"
			},
			"Key": "466E938E4AA5B443D005619DEB8F0382"
		},
		{
			"Source": {
				"Text": "Smart! Recipe"
			},
			"Translation": {
				"Text": "Smart! Рецепт"
			},
			"Key": "86A78F2C47F34655E5C58484EC93E3AD"
		},
		{
			"Source": {
				"Text": "Smart! Recipe"
			},
			"Translation": {
				"Text": "Smart! Рецепт"
			},
			"Key": "1C0157F7400B84FCEA0CB0997F18ECFA"
		},
		{
			"Source": {
				"Text": "Smart! Rotation"
			},
			"Translation": {
				"Text": "Smart! Обертання"
			},
			"Key": "E522B9984A797E90FDF435B93981833C"
		},
		{
			"Source": {
				"Text": "Smart! Spacing"
			},
			"Translation": {
				"Text": "Smart! Відстань"
			},
			"Key": "1D5643D5431C6F63F8A943BCE13CBE7E"
		},
		{
			"Source": {
				"Text": "Smart! Spacing"
			},
			"Translation": {
				"Text": "Smart! Відстань"
			},
			"Key": "246236E4495CCCF2A3E4FC85C85DA9AB"
		},
		{
			"Source": {
				"Text": "Smart! Spacing"
			},
			"Translation": {
				"Text": "Smart! Відстань"
			},
			"Key": "12DA0489426F414A397D0589ED6C0745"
		},
		{
			"Source": {
				"Text": "Smart! Stagger"
			},
			"Translation": {
				"Text": "Smart! Зміщення"
			},
			"Key": "5162B61A422973421A9B5084A1B41030"
		},
		{
			"Source": {
				"Text": "Smart! Stagger"
			},
			"Translation": {
				"Text": "Smart! Зміщення"
			},
			"Key": "F5885ED64196DAF6BE5F878ED0AF0A29"
		},
		{
			"Source": {
				"Text": "Smart! Steps"
			},
			"Translation": {
				"Text": "Smart! Сходинки"
			},
			"Key": "63AABDCD482973D2CAFDF2932D97AE25"
		},
		{
			"Source": {
				"Text": "Smart! Steps"
			},
			"Translation": {
				"Text": "Smart! Сходинки"
			},
			"Key": "067E1A5040E18EA163524F8F205335A9"
		},
		{
			"Source": {
				"Text": "Smart! Upgrade Panel"
			},
			"Translation": {
				"Text": "Smart! Панель оновлення"
			},
			"Key": "8BB84C5240D8A57F87983A986C3DFB73"
		},
		{
			"Source": {
				"Text": "Spacing Mode"
			},
			"Translation": {
				"Text": "Режим відстані"
			},
			"Key": "9643BBEF4D4BFEB216B5CDB73AC1A4C8"
		},
		{
			"Source": {
				"Text": "Stagger Left/Right"
			},
			"Translation": {
				"Text": "Зміщення ліворуч/праворуч"
			},
			"Key": "6F0E40FD4B11CA1CEC6FC5B06EB0188C"
		},
		{
			"Source": {
				"Text": "Stagger Mode"
			},
			"Translation": {
				"Text": "Режим зміщення"
			},
			"Key": "AC9521FE4F1ABB4F0FDA12BE408820F6"
		},
		{
			"Source": {
				"Text": "Steps Mode"
			},
			"Translation": {
				"Text": "Режим сходинок"
			},
			"Key": "A4625ACE4A31BA74C187C09C62723BE6"
		},
		{
			"Source": {
				"Text": "Steps Up/Down"
			},
			"Translation": {
				"Text": "Сходинки вгору/вниз"
			},
			"Key": "E148F27C4C01935B4E019BA49F4A0F55"
		},
		{
			"Source": {
				"Text": "Straight"
			},
			"Translation": {
				"Text": "Пряма"
			},
			"Key": "7D33892C463173CDF05A0383D92017C8"
		},
		{
			"Source": {
				"Text": "Straight"
			},
			"Translation": {
				"Text": "Пряма"
			},
			"Key": "8A7DD44D47B48C266B3B88AC01D1CEF3"
		},
		{
			"Source": {
				"Text": "Straight"
			},
			"Translation": {
				"Text": "Пряма"
			},
			"Key": "0019837C427C49F6BA1DE5A2BAF52104"
		},
		{
			"Source": {
				"Text": "Target Tier:"
			},
			"Translation": {
				"Text": "Цільовий рівень:"
			},
			"Key": "C34C1A5F452AB8290A9A00BA9D73780D"
		},
		{
			"Source": {
				"Text": "Target Tier:"
			},
			"Translation": {
				"Text": "Цільовий рівень:"
			},
			"Key": "47FABC9743E900C118B8FCAF9C9076DE"
		},
		{
			"Source": {
				"Text": "These tools diagnose and repair conveyor chain corruption. Only use them if you are experiencing belt issues."
			},
			"Translation": {
				"Text": "Ці інструменти діагностують і ремонтують пошкодження ланцюгів конвеєрів. Використовуйте їх лише за наявності проблем зі стрічками."
			},
			"Key": "427A62BA4B691763413124A521EE7AA2"
		},
		{
			"Source": {
				"Text": "Toggle Arrows"
			},
			"Translation": {
				"Text": "Перемкнути стрілки"
			},
			"Key": "3326E4B341828CD7663F6285E104A803"
		},
		{
			"Source": {
				"Text": "Toggle Settings Form"
			},
			"Translation": {
				"Text": "Перемкнути форму налаштувань"
			},
			"Key": "3E62D33F4FA4C52320AB48BD9B6D8B1C"
		},
		{
			"Source": {
				"Text": "Toggle Smart Settings Form"
			},
			"Translation": {
				"Text": "Перемкнути форму налаштувань Smart"
			},
			"Key": "D09E94C0499C4C4F3E606D9E2461B19A"
		},
		{
			"Source": {
				"Text": "Triage"
			},
			"Translation": {
				"Text": "Тріаж"
			},
			"Key": "D5988C104C18248A9BFD8485A40BE7BF"
		},
		{
			"Source": {
				"Text": "UPGRADE"
			},
			"Translation": {
				"Text": "ОНОВИТИ"
			},
			"Key": "0A60D4B54D01B286CA22F0A0967B6803"
		},
		{
			"Source": {
				"Text": "Warning message here"
			},
			"Translation": {
				"Text": "Тут повідомлення-попередження"
			},
			"Key": "BB16B38F4773E62C787CD8A7A950B2A0"
		},
		{
			"Source": {
				"Text": "X"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "1926932648C4B2B04FFA2DA78759EB8A"
		},
		{
			"Source": {
				"Text": "X (1)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "59B517F844E13DA8F3D539844F2C9378"
		},
		{
			"Source": {
				"Text": "X+Y (3)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "56027A5C460D5844EF237AB48DAA5A28"
		},
		{
			"Source": {
				"Text": "Y (2)"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "444B8B2648F771FC835D1CABC302BA9E"
		},
		{
			"Source": {
				"Text": "°"
			},
			"Translation": {
				"Text": ""
			},
			"Key": "23C90C2D418545EC4333738F056A5EE6"
		}
	],
	"Subnamespaces": [
		{
			"Namespace": "SmartFoundations",
			"Children": [
				{
					"Source": {
						"Text": " x "
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Upgrade_Separator"
				},
				{
					"Source": {
						"Text": "# of Connections to Keep Free:"
					},
					"Translation": {
						"Text": "# Зарезервовані з'єднання:"
					},
					"Key": "Config_PowerReserved"
				},
				{
					"Source": {
						"Text": "(No net cost)"
					},
					"Translation": {
						"Text": "(Без чистих витрат)"
					},
					"Key": "Upgrade_NoNetCost"
				},
				{
					"Source": {
						"Text": "({0} upgradeable)"
					},
					"Translation": {
						"Text": "({0} для оновлення)"
					},
					"Key": "Upgrade_UpgradeableCount"
				},
				{
					"Source": {
						"Text": "* Extreme grid - high risk of freeze/crash"
					},
					"Translation": {
						"Text": "* Екстремальна сітка - високий ризик зависання/збою"
					},
					"Key": "Panel_GridWarning_Danger"
				},
				{
					"Source": {
						"Text": "* Large grid"
					},
					"Translation": {
						"Text": "* Велика сітка"
					},
					"Key": "Panel_GridWarning_Caution"
				},
				{
					"Source": {
						"Text": "* Very large grid - may cause temporary freeze"
					},
					"Translation": {
						"Text": "* Дуже велика сітка - може спричинити тимчасове зависання"
					},
					"Key": "Panel_GridWarning_Warning"
				},
				{
					"Source": {
						"Text": "*Auto-Connect Disabled (double-tap to re-enable)"
					},
					"Translation": {
						"Text": "*Авто-з'єднання вимкнено (подвійне натискання для увімкнення)"
					},
					"Key": "HUD_AutoConnectDisabled"
				},
				{
					"Source": {
						"Text": "*Extend Active"
					},
					"Translation": {
						"Text": "*Розширення активне"
					},
					"Key": "HUD_ExtendActive"
				},
				{
					"Source": {
						"Text": "*Extend Disabled"
					},
					"Translation": {
						"Text": "*Розширення вимкнено"
					},
					"Key": "HUD_ExtendDisabled"
				},
				{
					"Source": {
						"Text": "*Extend: {0}x{1}"
					},
					"Translation": {
						"Text": "*Розширення: {0}x{1}"
					},
					"Key": "HUD_ExtendScaled"
				},
				{
					"Source": {
						"Text": "*Restore Active"
					},
					"Translation": {
						"Text": "*Відновлення активне"
					},
					"Key": "HUD_RestoreActive"
				},
				{
					"Source": {
						"Text": "*Restore: {0}"
					},
					"Translation": {
						"Text": "*Відновлення: {0}"
					},
					"Key": "HUD_RestorePreset"
				},
				{
					"Source": {
						"Text": "*Smart: Scaling only (double-tap to re-enable)"
					},
					"Translation": {
						"Text": "*Smart: лише масштабування (подвійне натискання для увімкнення)"
					},
					"Key": "HUD_SmartDisabled"
				},
				{
					"Source": {
						"Text": "*Walk  {0} seg | head {1} {2}deg | {3}"
					},
					"Translation": {
						"Text": "*Прохід  {0} сег | курс {1} {2}° | {3}"
					},
					"Key": "HUD_Walk"
				},
				{
					"Source": {
						"Text": "*Zoop Active - Scaling Disabled"
					},
					"Translation": {
						"Text": "*Zoop активний - Масштабування вимкнено"
					},
					"Key": "HUD_ZoopActive"
				},
				{
					"Source": {
						"Text": "A preset named '{0}' already exists. Overwrite?"
					},
					"Translation": {
						"Text": "Пресет з назвою '{0}' вже існує. Перезаписати?"
					},
					"Key": "Panel_Restore_OverwriteMessage"
				},
				{
					"Source": {
						"Text": "Advance m"
					},
					"Translation": {
						"Text": "Просування м"
					},
					"Key": "Walk_Col_Advance"
				},
				{
					"Source": {
						"Text": "Advance{0}: {1}m"
					},
					"Translation": {
						"Text": "Просування{0}: {1}м"
					},
					"Key": "HUD_WalkAdvance"
				},
				{
					"Source": {
						"Text": "Aim at a belt, pipe, or pole to scan its network"
					},
					"Translation": {
						"Text": "Наведіть на стрічку, трубу або стовп для сканування мережі"
					},
					"Key": "Upgrade_TraversalHint"
				},
				{
					"Source": {
						"Text": "Aim at a belt, pipe, or power pole to scan its network"
					},
					"Translation": {
						"Text": "Наведіть на стрічку, трубу або електростовп для сканування мережі"
					},
					"Key": "Upgrade_AimAtTarget"
				},
				{
					"Source": {
						"Text": "Aim at a buildable and press Scan Network"
					},
					"Translation": {
						"Text": "Наведіть на будівлю та натисніть Сканувати мережу"
					},
					"Key": "Upgrade_AimAndScan"
				},
				{
					"Source": {
						"Text": "Allow auto-connected belts to stack vertically where they overlap."
					},
					"Translation": {
						"Text": "Дозволити авто-з'єднаним стрічкам складатися вертикально в місцях перетину."
					},
					"Key": "P.bStackableBeltEnabled.TT"
				},
				{
					"Source": {
						"Text": "Anchor: {0} (Mk{1})"
					},
					"Translation": {
						"Text": "Якір: {0} (Mk{1})"
					},
					"Key": "Upgrade_Anchor"
				},
				{
					"Source": {
						"Text": "Animate the arrows orbiting the hologram. Turn off for static arrows that still track you."
					},
					"Translation": {
						"Text": "Анімувати обертання стрілок навколо голограми. Вимкніть для статичних стрілок, які все одно стежать за вами."
					},
					"Key": "P.bShowArrowOrbit.TT"
				},
				{
					"Source": {
						"Text": "Apply"
					},
					"Translation": {
						"Text": "Застосувати"
					},
					"Key": "Panel_Btn_ApplyPreset"
				},
				{
					"Source": {
						"Text": "Apply"
					},
					"Translation": {
						"Text": "Застосувати"
					},
					"Key": "Panel_Btn_Apply"
				},
				{
					"Source": {
						"Text": "Apply Immediately"
					},
					"Translation": {
						"Text": "Застосувати негайно"
					},
					"Key": "Config_ApplyImmediate"
				},
				{
					"Source": {
						"Text": "Apply Immediately"
					},
					"Translation": {
						"Text": "Застосувати негайно"
					},
					"Key": "P.bApplyImmediately"
				},
				{
					"Source": {
						"Text": "Apply Immediately:"
					},
					"Translation": {
						"Text": "Застосувати негайно:"
					},
					"Key": "Panel_ApplyImmediately"
				},
				{
					"Source": {
						"Text": "Apply Smart Panel changes instantly instead of clicking the Apply button."
					},
					"Translation": {
						"Text": "Застосовувати зміни Smart Панелі миттєво замість натискання кнопки Застосувати."
					},
					"Key": "P.bApplyImmediately.TT"
				},
				{
					"Source": {
						"Text": "Arrow Axis Labels"
					},
					"Translation": {
						"Text": "Мітки осей стрілок"
					},
					"Key": "P.bShowArrowLabels"
				},
				{
					"Source": {
						"Text": "Arrow Axis Labels:"
					},
					"Translation": {
						"Text": "Мітки осей стрілок:"
					},
					"Key": "Config_ArrowLabels"
				},
				{
					"Source": {
						"Text": "Arrow Orbit Animation"
					},
					"Translation": {
						"Text": "Анімація орбіти стрілок"
					},
					"Key": "P.bShowArrowOrbit"
				},
				{
					"Source": {
						"Text": "Arrow Orbit Animation:"
					},
					"Translation": {
						"Text": "Анімація орбіти стрілок:"
					},
					"Key": "Config_ArrowOrbit"
				},
				{
					"Source": {
						"Text": "Arrows"
					},
					"Translation": {
						"Text": "Стрілки"
					},
					"Key": "Sec.Arrows"
				},
				{
					"Source": {
						"Text": "Audit Complete: {0} upgradeable found across {1} structures."
					},
					"Translation": {
						"Text": "Аудит завершено: {0} для оновлення серед {1} структур."
					},
					"Key": "Upgrade_AuditComplete"
				},
				{
					"Source": {
						"Text": "Audit failed or was canceled."
					},
					"Translation": {
						"Text": "Аудит не вдався або був скасований."
					},
					"Key": "Upgrade_AuditFailed"
				},
				{
					"Source": {
						"Text": "Auditing world... {0}% ({1} scanned)"
					},
					"Translation": {
						"Text": "Аудит світу... {0}% ({1} скановано)"
					},
					"Key": "Upgrade_AuditProgress"
				},
				{
					"Source": {
						"Text": "Auto"
					},
					"Translation": {
						"Text": "Авто"
					},
					"Key": "Walk_Opt_Auto"
				},
				{
					"Source": {
						"Text": "Auto 2D"
					},
					"Translation": {
						"Text": "Авто 2D"
					},
					"Key": "Walk_Opt_Auto2D"
				},
				{
					"Source": {
						"Text": "Auto-Connect"
					},
					"Translation": {
						"Text": "Авто-з'єднання"
					},
					"Key": "Panel_AutoConnectHeader"
				},
				{
					"Source": {
						"Text": "Auto-Connect"
					},
					"Translation": {
						"Text": "Авто-з'єднання"
					},
					"Key": "Panel_Restore_CaptureAutoConnect"
				},
				{
					"Source": {
						"Text": "Auto-Hold on Grid Change"
					},
					"Translation": {
						"Text": "Авто-утримання при зміні сітки"
					},
					"Key": "P.bAutoHoldOnGridChange"
				},
				{
					"Source": {
						"Text": "Auto-Hold on Grid Change:"
					},
					"Translation": {
						"Text": "Авто-утримання при зміні сітки:"
					},
					"Key": "Config_AutoHold"
				},
				{
					"Source": {
						"Text": "Automatically connect conveyor belts between placed buildings and distributors."
					},
					"Translation": {
						"Text": "Автоматично з'єднувати конвеєрні стрічки між розміщеними будівлями та розподільниками."
					},
					"Key": "P.bAutoConnectEnabled.TT"
				},
				{
					"Source": {
						"Text": "Automatically connect hypertubes between placed supports."
					},
					"Translation": {
						"Text": "Автоматично з'єднувати гіпертруби між розміщеними опорами."
					},
					"Key": "P.bHypertubeAutoConnectEnabled.TT"
				},
				{
					"Source": {
						"Text": "Automatically connect pipes between placed buildings."
					},
					"Translation": {
						"Text": "Автоматично з'єднувати труби між розміщеними будівлями."
					},
					"Key": "P.bPipeAutoConnectEnabled.TT"
				},
				{
					"Source": {
						"Text": "Automatically lock the hologram in place after any grid change. Press the Hold key to release it."
					},
					"Translation": {
						"Text": "Автоматично фіксувати голограму на місці після будь-якої зміни сітки. Натисніть клавішу Утримання, щоб відпустити."
					},
					"Key": "P.bAutoHoldOnGridChange.TT"
				},
				{
					"Source": {
						"Text": "Automatically run conveyor belts between the buildings you place."
					},
					"Translation": {
						"Text": "Автоматично прокладати конвеєрні стрічки між будівлями, які ви розміщуєте."
					},
					"Key": "Sec.Belt.TT"
				},
				{
					"Source": {
						"Text": "Automatically run hypertubes between the supports you place."
					},
					"Translation": {
						"Text": "Автоматично прокладати гіпертруби між розміщеними опорами."
					},
					"Key": "Sec.Hypertube.TT"
				},
				{
					"Source": {
						"Text": "Automatically run pipes between the buildings you place."
					},
					"Translation": {
						"Text": "Автоматично прокладати труби між будівлями, які ви розміщуєте."
					},
					"Key": "Sec.Pipe.TT"
				},
				{
					"Source": {
						"Text": "Automatically wire power between buildings and power poles as you build."
					},
					"Translation": {
						"Text": "Автоматично підключати живлення між будівлями та електростовпами під час будівництва."
					},
					"Key": "Sec.Power.TT"
				},
				{
					"Source": {
						"Text": "Automatically wire power between placed buildings and nearby power poles."
					},
					"Translation": {
						"Text": "Автоматично підключати живлення між розміщеними будівлями та найближчими електростовпами."
					},
					"Key": "P.bPowerAutoConnectEnabled.TT"
				},
				{
					"Source": {
						"Text": "Backward"
					},
					"Translation": {
						"Text": "Назад"
					},
					"Key": "Walk_Opt_Backward"
				},
				{
					"Source": {
						"Text": "Belt"
					},
					"Translation": {
						"Text": "Стрічка"
					},
					"Key": "Walk_Conveyance_Belt"
				},
				{
					"Source": {
						"Text": "Belt Auto-Connect"
					},
					"Translation": {
						"Text": "Авто-з'єднання стрічок"
					},
					"Key": "Sec.Belt"
				},
				{
					"Source": {
						"Text": "Belt Auto-Connect"
					},
					"Translation": {
						"Text": "Авто-з'єднання стрічок"
					},
					"Key": "P.bAutoConnectEnabled"
				},
				{
					"Source": {
						"Text": "Belt Auto-Connect:"
					},
					"Translation": {
						"Text": "Авто-з'єднання стрічок:"
					},
					"Key": "Config_AutoConnectEnabled"
				},
				{
					"Source": {
						"Text": "Belt Auto-Connect:"
					},
					"Translation": {
						"Text": "Авто-з'єднання стрічок:"
					},
					"Key": "Panel_AC_BeltEnabled"
				},
				{
					"Source": {
						"Text": "Belt Routing Mode"
					},
					"Translation": {
						"Text": "Режим маршрутизації стрічок"
					},
					"Key": "P.BeltRoutingMode"
				},
				{
					"Source": {
						"Text": "Belt Routing Mode:"
					},
					"Translation": {
						"Text": "Режим маршрутизації стрічок:"
					},
					"Key": "Config_BeltRoutingMode"
				},
				{
					"Source": {
						"Text": "Belt tier for distributor-to-building connections. Auto uses the highest tier you've unlocked."
					},
					"Translation": {
						"Text": "Рівень стрічки для з'єднань розподільник-будівля. Авто використовує найвищий розблокований рівень."
					},
					"Key": "P.BeltLevelToBuilding.TT"
				},
				{
					"Source": {
						"Text": "Belt tier for distributor-to-distributor (manifold) connections. Auto uses the highest tier you've unlocked."
					},
					"Translation": {
						"Text": "Рівень стрічки для з'єднань розподільник-розподільник (колектор). Авто використовує найвищий розблокований рівень."
					},
					"Key": "P.BeltLevelMain.TT"
				},
				{
					"Source": {
						"Text": "Building Behavior"
					},
					"Translation": {
						"Text": "Поведінка будівництва"
					},
					"Key": "Sec.Building"
				},
				{
					"Source": {
						"Text": "Cancel"
					},
					"Translation": {
						"Text": "Скасувати"
					},
					"Key": "Upgrade_Btn_Cancel"
				},
				{
					"Source": {
						"Text": "Cancel"
					},
					"Translation": {
						"Text": "Скасувати"
					},
					"Key": "Panel_Btn_Cancel"
				},
				{
					"Source": {
						"Text": "Cannot find player location"
					},
					"Translation": {
						"Text": "Не вдалося знайти позицію гравця"
					},
					"Key": "Upgrade_NoPlayerLoc"
				},
				{
					"Source": {
						"Text": "Capture:"
					},
					"Translation": {
						"Text": "Захоплення:"
					},
					"Key": "Panel_Restore_Capture"
				},
				{
					"Source": {
						"Text": "Chain distributors together with manifold lane belts, so a whole row is fed from one input."
					},
					"Translation": {
						"Text": "З'єднувати розподільники в ланцюг стрічками колектора, щоб увесь ряд живився з одного входу."
					},
					"Key": "P.bAutoConnectDistributors.TT"
				},
				{
					"Source": {
						"Text": "Chain:"
					},
					"Translation": {
						"Text": "Ланцюг:"
					},
					"Key": "Panel_AC_Chain"
				},
				{
					"Source": {
						"Text": "Clean"
					},
					"Translation": {
						"Text": "Чиста"
					},
					"Key": "Walk_Opt_Clean"
				},
				{
					"Source": {
						"Text": "Clear"
					},
					"Translation": {
						"Text": "Очистити"
					},
					"Key": "Panel_Btn_ClearRecipe"
				},
				{
					"Source": {
						"Text": "Click to select {0} for upgrade"
					},
					"Translation": {
						"Text": "Натисніть, щоб вибрати {0} для оновлення"
					},
					"Key": "Upgrade_ClickToSelect"
				},
				{
					"Source": {
						"Text": "Close"
					},
					"Translation": {
						"Text": "Закрити"
					},
					"Key": "Upgrade_Btn_Close"
				},
				{
					"Source": {
						"Text": "Color theme for the HUD: Default (FICSIT orange), Dark, Classic, High Contrast, Minimal, or Monochrome."
					},
					"Translation": {
						"Text": "Кольорова тема HUD: За замовчуванням (помаранчевий FICSIT), Темна, Класична, Високий контраст, Мінімальна або Monochrome."
					},
					"Key": "P.HUDTheme.TT"
				},
				{
					"Source": {
						"Text": "Connection Range"
					},
					"Translation": {
						"Text": "Дальність з'єднання"
					},
					"Key": "P.PowerConnectRange"
				},
				{
					"Source": {
						"Text": "Connection Range:"
					},
					"Translation": {
						"Text": "Дальність з'єднання:"
					},
					"Key": "Config_PowerRange"
				},
				{
					"Source": {
						"Text": "Connections to Keep Free"
					},
					"Translation": {
						"Text": "Зарезервовані з'єднання"
					},
					"Key": "P.PowerConnectReserved"
				},
				{
					"Source": {
						"Text": "Continue"
					},
					"Translation": {
						"Text": "Продовжити"
					},
					"Key": "Panel_Btn_Continue"
				},
				{
					"Source": {
						"Text": "Conveyor Belts"
					},
					"Translation": {
						"Text": "Конвеєрні стрічки"
					},
					"Key": "Family_Belt"
				},
				{
					"Source": {
						"Text": "Conveyor Lifts"
					},
					"Translation": {
						"Text": "Конвеєрні підіймачі"
					},
					"Key": "Family_Lift"
				},
				{
					"Source": {
						"Text": "Created:"
					},
					"Translation": {
						"Text": "Створено:"
					},
					"Key": "Panel_Restore_CreatedAt"
				},
				{
					"Source": {
						"Text": "Cross Splitters/Mergers"
					},
					"Translation": {
						"Text": "Через розділювачі/об'єднувачі"
					},
					"Key": "Upgrade_CrossSplitters"
				},
				{
					"Source": {
						"Text": "Cross Storage Containers"
					},
					"Translation": {
						"Text": "Через контейнери зберігання"
					},
					"Key": "Upgrade_CrossStorage"
				},
				{
					"Source": {
						"Text": "Cross Train Platforms"
					},
					"Translation": {
						"Text": "Через залізничні платформи"
					},
					"Key": "Upgrade_CrossTrains"
				},
				{
					"Source": {
						"Text": "Curve"
					},
					"Translation": {
						"Text": "Крива"
					},
					"Key": "Walk_Opt_Curve"
				},
				{
					"Source": {
						"Text": "Cycle Mode"
					},
					"Translation": {
						"Text": "Циклічний режим"
					},
					"Key": "Hint_CycleMode"
				},
				{
					"Source": {
						"Text": "Daisy-Chain Pole-less Factories"
					},
					"Translation": {
						"Text": "Послідовне з'єднання заводів без стовпів"
					},
					"Key": "P.bExtendDaisyChainPoleless"
				},
				{
					"Source": {
						"Text": "Default"
					},
					"Translation": {
						"Text": "За замовчуванням"
					},
					"Key": "Walk_Opt_Default"
				},
				{
					"Source": {
						"Text": "Delete"
					},
					"Translation": {
						"Text": "Видалити"
					},
					"Key": "Panel_Btn_DeletePreset"
				},
				{
					"Source": {
						"Text": "Delete Preset"
					},
					"Translation": {
						"Text": "Видалити пресет"
					},
					"Key": "Panel_Restore_DeleteTitle"
				},
				{
					"Source": {
						"Text": "Delete preset '{0}'?"
					},
					"Translation": {
						"Text": "Видалити пресет '{0}'?"
					},
					"Key": "Panel_Restore_DeleteMessage"
				},
				{
					"Source": {
						"Text": "Description:"
					},
					"Translation": {
						"Text": "Опис:"
					},
					"Key": "Panel_Restore_Description"
				},
				{
					"Source": {
						"Text": "Direction"
					},
					"Translation": {
						"Text": "Напрямок"
					},
					"Key": "Walk_Lbl_Direction"
				},
				{
					"Source": {
						"Text": "Direction:"
					},
					"Translation": {
						"Text": "Напрямок:"
					},
					"Key": "Panel_AC_Direction"
				},
				{
					"Source": {
						"Text": "Directional arrows drawn on the building hologram."
					},
					"Translation": {
						"Text": "Стрілки напрямку, намальовані на голограмі будівлі."
					},
					"Key": "Sec.Arrows.TT"
				},
				{
					"Source": {
						"Text": "Double Wall Outlet Mk.{0}"
					},
					"Translation": {
						"Text": "Подвійна настінна розетка Mk.{0}"
					},
					"Key": "UpgradeRow_DoubleWallOutlet"
				},
				{
					"Source": {
						"Text": "EXTREME GRID WARNING!"
					},
					"Translation": {
						"Text": "ПОПЕРЕДЖЕННЯ ПРО ЕКСТРЕМАЛЬНУ СІТКУ!"
					},
					"Key": "Panel_Confirm_ExtremeTitle"
				},
				{
					"Source": {
						"Text": "Enable Extend - repeat a building or grid outward in one direction."
					},
					"Translation": {
						"Text": "Увімкнути Розширення - повторювати будівлю або сітку назовні в одному напрямку."
					},
					"Key": "P.bExtendEnabled.TT"
				},
				{
					"Source": {
						"Text": "Entire Map"
					},
					"Translation": {
						"Text": "Вся карта"
					},
					"Key": "Upgrade_Btn_EntireMap"
				},
				{
					"Source": {
						"Text": "Error: Execution service not available"
					},
					"Translation": {
						"Text": "Помилка: Служба виконання недоступна"
					},
					"Key": "Upgrade_ErrExecution"
				},
				{
					"Source": {
						"Text": "Error: No player controller"
					},
					"Translation": {
						"Text": "Помилка: Немає контролера гравця"
					},
					"Key": "Upgrade_ErrNoPlayer"
				},
				{
					"Source": {
						"Text": "Error: Subsystem not available"
					},
					"Translation": {
						"Text": "Помилка: Підсистема недоступна"
					},
					"Key": "Upgrade_ErrSubsystem"
				},
				{
					"Source": {
						"Text": "Error: server connection unavailable"
					},
					"Translation": {
						"Text": "Помилка: з'єднання з сервером недоступне"
					},
					"Key": "Upgrade_ErrRCOScan"
				},
				{
					"Source": {
						"Text": "Error: server connection unavailable"
					},
					"Translation": {
						"Text": "Помилка: з'єднання з сервером недоступне"
					},
					"Key": "Upgrade_ErrRCO"
				},
				{
					"Source": {
						"Text": "Estimated Cost"
					},
					"Translation": {
						"Text": "Орієнтовна вартість"
					},
					"Key": "Upgrade_EstimatedCost"
				},
				{
					"Source": {
						"Text": "Exit"
					},
					"Translation": {
						"Text": "Курс виходу"
					},
					"Key": "Walk_Col_Exit"
				},
				{
					"Source": {
						"Text": "Export to Clipboard"
					},
					"Translation": {
						"Text": "Експорт у буфер обміну"
					},
					"Key": "Panel_Btn_ExportPreset"
				},
				{
					"Source": {
						"Text": "Extend Daisy-Chain Power"
					},
					"Translation": {
						"Text": "Послідовне живлення Розширення"
					},
					"Key": "P.bExtendDaisyChainPower"
				},
				{
					"Source": {
						"Text": "Extend Enabled"
					},
					"Translation": {
						"Text": "Розширення увімкнено"
					},
					"Key": "P.bExtendEnabled"
				},
				{
					"Source": {
						"Text": "Extend Enabled:"
					},
					"Translation": {
						"Text": "Розширення увімкнено:"
					},
					"Key": "Config_ExtendEnabled"
				},
				{
					"Source": {
						"Text": "Extend Power Poles"
					},
					"Translation": {
						"Text": "Розширення ел. стовпів"
					},
					"Key": "P.bExtendPowerEnabled"
				},
				{
					"Source": {
						"Text": "Extend Power Poles:"
					},
					"Translation": {
						"Text": "Розширення ел. стовпів:"
					},
					"Key": "Config_ExtendPower"
				},
				{
					"Source": {
						"Text": "Factory Belt"
					},
					"Translation": {
						"Text": "Заводська стрічка"
					},
					"Key": "P.BeltLevelToBuilding"
				},
				{
					"Source": {
						"Text": "Factory Belt:"
					},
					"Translation": {
						"Text": "Заводська стрічка:"
					},
					"Key": "Config_FactoryBelt"
				},
				{
					"Source": {
						"Text": "Flow Indicator"
					},
					"Translation": {
						"Text": "Індикатор потоку"
					},
					"Key": "P.PipeIndicator"
				},
				{
					"Source": {
						"Text": "Flow Indicator:"
					},
					"Translation": {
						"Text": "Індикатор потоку:"
					},
					"Key": "Config_FlowIndicator"
				},
				{
					"Source": {
						"Text": "Flow Indicator:"
					},
					"Translation": {
						"Text": "Індикатор потоку:"
					},
					"Key": "Panel_AC_FlowIndicator"
				},
				{
					"Source": {
						"Text": "Forward"
					},
					"Translation": {
						"Text": "Вперед"
					},
					"Key": "Walk_Opt_Forward"
				},
				{
					"Source": {
						"Text": "Found {0} items ({1} upgradeable)"
					},
					"Translation": {
						"Text": "Знайдено {0} елементів ({1} для оновлення)"
					},
					"Key": "Upgrade_FoundItems"
				},
				{
					"Source": {
						"Text": "Grid"
					},
					"Translation": {
						"Text": "Сітка"
					},
					"Key": "Panel_Section_Grid"
				},
				{
					"Source": {
						"Text": "Grid"
					},
					"Translation": {
						"Text": "Сітка"
					},
					"Key": "Panel_Restore_CaptureGrid"
				},
				{
					"Source": {
						"Text": "Grid Axis"
					},
					"Translation": {
						"Text": "Вісь сітки"
					},
					"Key": "P.PowerConnectMode"
				},
				{
					"Source": {
						"Text": "Grid Axis:"
					},
					"Translation": {
						"Text": "Вісь сітки:"
					},
					"Key": "Panel_AC_GridAxis"
				},
				{
					"Source": {
						"Text": "Grid Axis:"
					},
					"Translation": {
						"Text": "Вісь сітки:"
					},
					"Key": "Config_PowerGridAxis"
				},
				{
					"Source": {
						"Text": "Grid Total: {0} holograms"
					},
					"Translation": {
						"Text": "Всього сітка: {0} голограм"
					},
					"Key": "Panel_GridTotal"
				},
				{
					"Source": {
						"Text": "Grid [X]:"
					},
					"Translation": {
						"Text": "Сітка [X]:"
					},
					"Key": "Panel_GridX"
				},
				{
					"Source": {
						"Text": "Grid [Y]:"
					},
					"Translation": {
						"Text": "Сітка [Y]:"
					},
					"Key": "Panel_GridY"
				},
				{
					"Source": {
						"Text": "Grid [Z]:"
					},
					"Translation": {
						"Text": "Сітка [Z]:"
					},
					"Key": "Panel_GridZ"
				},
				{
					"Source": {
						"Text": "Grid: 1x1x1"
					},
					"Translation": {
						"Text": "Сітка: 1x1x1"
					},
					"Key": "HUD_GridDefault"
				},
				{
					"Source": {
						"Text": "Grid: {0}x{1}x{2} ({3})"
					},
					"Translation": {
						"Text": "Сітка: {0}x{1}x{2} ({3})"
					},
					"Key": "HUD_Grid"
				},
				{
					"Source": {
						"Text": "H->V"
					},
					"Translation": {
						"Text": "Гор.→Верт."
					},
					"Key": "Walk_Opt_HToV"
				},
				{
					"Source": {
						"Text": "HUD"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Sec.HUD"
				},
				{
					"Source": {
						"Text": "HUD Position X"
					},
					"Translation": {
						"Text": "Позиція HUD X"
					},
					"Key": "Config_HUDPosX"
				},
				{
					"Source": {
						"Text": "HUD Position X"
					},
					"Translation": {
						"Text": "Позиція HUD X"
					},
					"Key": "P.HUDPositionX"
				},
				{
					"Source": {
						"Text": "HUD Position Y"
					},
					"Translation": {
						"Text": "Позиція HUD Y"
					},
					"Key": "P.HUDPositionY"
				},
				{
					"Source": {
						"Text": "HUD Position Y"
					},
					"Translation": {
						"Text": "Позиція HUD Y"
					},
					"Key": "Config_HUDPosY"
				},
				{
					"Source": {
						"Text": "HUD Scale"
					},
					"Translation": {
						"Text": "Масштаб HUD"
					},
					"Key": "P.HUDScale"
				},
				{
					"Source": {
						"Text": "HUD Theme"
					},
					"Translation": {
						"Text": "Тема HUD"
					},
					"Key": "P.HUDTheme"
				},
				{
					"Source": {
						"Text": "HUD Theme:"
					},
					"Translation": {
						"Text": "Тема HUD:"
					},
					"Key": "Config_HUDTheme"
				},
				{
					"Source": {
						"Text": "Horizontal position of the HUD on screen (0 = left edge, 1 = right edge)."
					},
					"Translation": {
						"Text": "Горизонтальна позиція HUD на екрані (0 = лівий край, 1 = правий край)."
					},
					"Key": "P.HUDPositionX.TT"
				},
				{
					"Source": {
						"Text": "How Extend, auto-hold, and Apply behave while building."
					},
					"Translation": {
						"Text": "Як поводяться Розширення, авто-утримання та Застосувати під час будівництва."
					},
					"Key": "Sec.Building.TT"
				},
				{
					"Source": {
						"Text": "How auto-connected belts are shaped: Default, Curve, or Straight."
					},
					"Translation": {
						"Text": "Форма авто-з'єднаних стрічок: За замовчуванням, Крива або Пряма."
					},
					"Key": "P.BeltRoutingMode.TT"
				},
				{
					"Source": {
						"Text": "How auto-connected hypertubes are shaped: Auto, 2D, Straight, Curve, Noodle, or Horizontal-to-Vertical."
					},
					"Translation": {
						"Text": "Форма авто-з'єднаних гіпертруб: Авто, 2D, Пряма, Крива, Гнучка або Горизонтально-Вертикальна."
					},
					"Key": "P.HypertubeRoutingMode.TT"
				},
				{
					"Source": {
						"Text": "How auto-connected pipes are shaped: Auto, 2D, Straight, Curve, Noodle, or Horizontal-to-Vertical."
					},
					"Translation": {
						"Text": "Форма авто-з'єднаних труб: Авто, 2D, Пряма, Крива, Гнучка або Горизонтально-Вертикальна."
					},
					"Key": "P.PipeRoutingMode.TT"
				},
				{
					"Source": {
						"Text": "Hypertube"
					},
					"Translation": {
						"Text": "Гіпертруба"
					},
					"Key": "Walk_Conveyance_Hypertube"
				},
				{
					"Source": {
						"Text": "Hypertube Auto-Connect"
					},
					"Translation": {
						"Text": "Авто-з'єднання гіпертруб"
					},
					"Key": "Sec.Hypertube"
				},
				{
					"Source": {
						"Text": "Hypertube Auto-Connect"
					},
					"Translation": {
						"Text": "Авто-з'єднання гіпертруб"
					},
					"Key": "P.bHypertubeAutoConnectEnabled"
				},
				{
					"Source": {
						"Text": "Hypertube Routing Mode"
					},
					"Translation": {
						"Text": "Режим маршрутизації гіпертруб"
					},
					"Key": "P.HypertubeRoutingMode"
				},
				{
					"Source": {
						"Text": "Import from Clipboard"
					},
					"Translation": {
						"Text": "Імпорт з буфера обміну"
					},
					"Key": "Panel_Btn_ImportPreset"
				},
				{
					"Source": {
						"Text": "Import from Last Extend"
					},
					"Translation": {
						"Text": "Імпорт з останнього Розширення"
					},
					"Key": "Panel_Btn_ImportFromExtend"
				},
				{
					"Source": {
						"Text": "Include power poles when using Extend."
					},
					"Translation": {
						"Text": "Враховувати електростовпи при використанні Розширення."
					},
					"Key": "P.bExtendPowerEnabled.TT"
				},
				{
					"Source": {
						"Text": "Invalid: {0}"
					},
					"Translation": {
						"Text": "Недійсне: {0}"
					},
					"Key": "Upgrade_Invalid"
				},
				{
					"Source": {
						"Text": "Large Grid Warning"
					},
					"Translation": {
						"Text": "Попередження про велику сітку"
					},
					"Key": "Panel_Confirm_LargeTitle"
				},
				{
					"Source": {
						"Text": "Lift: ↕ {0}m  ⇓ {1}m"
					},
					"Translation": {
						"Text": "Підйом: ↕ {0}м  ⇓ {1}м"
					},
					"Key": "HUD_LiftHeight"
				},
				{
					"Source": {
						"Text": "Main Tier"
					},
					"Translation": {
						"Text": "Основний рівень"
					},
					"Key": "P.PipeLevelMain"
				},
				{
					"Source": {
						"Text": "Main Tier:"
					},
					"Translation": {
						"Text": "Основний рівень:"
					},
					"Key": "Panel_AC_MainTier"
				},
				{
					"Source": {
						"Text": "Main Tier:"
					},
					"Translation": {
						"Text": "Основний рівень:"
					},
					"Key": "Config_PipeMainTier"
				},
				{
					"Source": {
						"Text": "Manifold Lane Belt"
					},
					"Translation": {
						"Text": "Стрічка колектора"
					},
					"Key": "P.BeltLevelMain"
				},
				{
					"Source": {
						"Text": "Manifold Lane Belt:"
					},
					"Translation": {
						"Text": "Стрічка колектора:"
					},
					"Key": "Config_ManifoldLaneBelt"
				},
				{
					"Source": {
						"Text": "Maximum distance, in meters, to search for a power connection."
					},
					"Translation": {
						"Text": "Максимальна відстань у метрах для пошуку з'єднання живлення."
					},
					"Key": "P.PowerConnectRange.TT"
				},
				{
					"Source": {
						"Text": "Nearest {0}: {1}m {2}"
					},
					"Translation": {
						"Text": "Найближчий {0}: {1}м {2}"
					},
					"Key": "Upgrade_Nearest"
				},
				{
					"Source": {
						"Text": "Network"
					},
					"Translation": {
						"Text": "Мережа"
					},
					"Key": "Upgrade_Tab_Network"
				},
				{
					"Source": {
						"Text": "New Preset Name:"
					},
					"Translation": {
						"Text": "Назва нового пресету:"
					},
					"Key": "Panel_Restore_PresetName"
				},
				{
					"Source": {
						"Text": "No audit snapshot. Press Scan to start."
					},
					"Translation": {
						"Text": "Немає знімку аудиту. Натисніть Сканування."
					},
					"Key": "Upgrade_NoAudit"
				},
				{
					"Source": {
						"Text": "No compatible recipes"
					},
					"Translation": {
						"Text": "Немає сумісних рецептів"
					},
					"Key": "Panel_Recipe_NoCompatible"
				},
				{
					"Source": {
						"Text": "No family selected - scan first"
					},
					"Translation": {
						"Text": "Сімейство не обрано - спочатку скануйте"
					},
					"Key": "Upgrade_NoFamily"
				},
				{
					"Source": {
						"Text": "No instances found (entries not stored)"
					},
					"Translation": {
						"Text": "Екземпляри не знайдено (записи не збережені)"
					},
					"Key": "Upgrade_NoInstances"
				},
				{
					"Source": {
						"Text": "No items to upgrade"
					},
					"Translation": {
						"Text": "Немає елементів для оновлення"
					},
					"Key": "Upgrade_NoItems"
				},
				{
					"Source": {
						"Text": "No recipe selected ({0} available)"
					},
					"Translation": {
						"Text": "Рецепт не обрано ({0} доступних)"
					},
					"Key": "Panel_Recipe_NoneSelected_Count"
				},
				{
					"Source": {
						"Text": "No target - aim at a buildable"
					},
					"Translation": {
						"Text": "Немає цілі - наведіть на будівлю"
					},
					"Key": "Upgrade_NoTarget"
				},
				{
					"Source": {
						"Text": "None Selected"
					},
					"Translation": {
						"Text": "Не обрано"
					},
					"Key": "Panel_Recipe_NoneSelected"
				},
				{
					"Source": {
						"Text": "Noodle"
					},
					"Translation": {
						"Text": "Гнучка"
					},
					"Key": "Walk_Opt_Noodle"
				},
				{
					"Source": {
						"Text": "Normal"
					},
					"Translation": {
						"Text": "Звичайна"
					},
					"Key": "Walk_Opt_Normal"
				},
				{
					"Source": {
						"Text": "Not saved"
					},
					"Translation": {
						"Text": "Не збережено"
					},
					"Key": "Panel_Restore_NotSaved"
				},
				{
					"Source": {
						"Text": "Number of pole connection slots to leave free for your own manual wiring."
					},
					"Translation": {
						"Text": "Кількість слотів з'єднання стовпа, які залишити вільними для власного ручного підключення."
					},
					"Key": "P.PowerConnectReserved.TT"
				},
				{
					"Source": {
						"Text": "Once Upgraded Power Connectors is unlocked, Extend wires power directly building-to-building along the lane instead of running a pole to each building."
					},
					"Translation": {
						"Text": "Щойно розблоковано Покращені роз'єми живлення, Розширення з'єднує живлення напряму від будівлі до будівлі вздовж ряду замість прокладання стовпа до кожної будівлі."
					},
					"Key": "P.bExtendDaisyChainPower.TT"
				},
				{
					"Source": {
						"Text": "Overwrite Preset"
					},
					"Translation": {
						"Text": "Перезаписати пресет"
					},
					"Key": "Panel_Restore_OverwriteTitle"
				},
				{
					"Source": {
						"Text": "Pipe"
					},
					"Translation": {
						"Text": "Труба"
					},
					"Key": "Walk_Conveyance_Pipe"
				},
				{
					"Source": {
						"Text": "Pipe Auto-Connect"
					},
					"Translation": {
						"Text": "Авто-з'єднання труб"
					},
					"Key": "Sec.Pipe"
				},
				{
					"Source": {
						"Text": "Pipe Auto-Connect"
					},
					"Translation": {
						"Text": "Авто-з'єднання труб"
					},
					"Key": "P.bPipeAutoConnectEnabled"
				},
				{
					"Source": {
						"Text": "Pipe Auto-Connect:"
					},
					"Translation": {
						"Text": "Авто-з'єднання труб:"
					},
					"Key": "Config_PipeAutoConnect"
				},
				{
					"Source": {
						"Text": "Pipe Auto-Connect:"
					},
					"Translation": {
						"Text": "Авто-з'єднання труб:"
					},
					"Key": "Panel_AC_PipeEnabled"
				},
				{
					"Source": {
						"Text": "Pipe Routing Mode"
					},
					"Translation": {
						"Text": "Режим маршрутизації труб"
					},
					"Key": "P.PipeRoutingMode"
				},
				{
					"Source": {
						"Text": "Pipe Routing Mode:"
					},
					"Translation": {
						"Text": "Режим маршрутизації труб:"
					},
					"Key": "Config_PipeRoutingMode"
				},
				{
					"Source": {
						"Text": "Pipe Style"
					},
					"Translation": {
						"Text": "Стиль труби"
					},
					"Key": "Walk_Lbl_PipeStyle"
				},
				{
					"Source": {
						"Text": "Pipe tier for connections to buildings. Auto uses the highest tier you've unlocked."
					},
					"Translation": {
						"Text": "Рівень труби для з'єднань до будівель. Авто використовує найвищий розблокований рівень."
					},
					"Key": "P.PipeLevelToBuilding.TT"
				},
				{
					"Source": {
						"Text": "Pipe tier for the main connections. Auto uses the highest tier you've unlocked."
					},
					"Translation": {
						"Text": "Рівень труби для основних з'єднань. Авто використовує найвищий розблокований рівень."
					},
					"Key": "P.PipeLevelMain.TT"
				},
				{
					"Source": {
						"Text": "Pipeline Pumps"
					},
					"Translation": {
						"Text": "Трубні насоси"
					},
					"Key": "Family_Pump"
				},
				{
					"Source": {
						"Text": "Pipelines"
					},
					"Translation": {
						"Text": "Трубопроводи"
					},
					"Key": "Family_Pipe"
				},
				{
					"Source": {
						"Text": "Power Auto-Connect"
					},
					"Translation": {
						"Text": "Авто-з'єднання живлення"
					},
					"Key": "Sec.Power"
				},
				{
					"Source": {
						"Text": "Power Auto-Connect"
					},
					"Translation": {
						"Text": "Авто-з'єднання живлення"
					},
					"Key": "P.bPowerAutoConnectEnabled"
				},
				{
					"Source": {
						"Text": "Power Auto-Connect:"
					},
					"Translation": {
						"Text": "Авто-з'єднання живлення:"
					},
					"Key": "Config_PowerAutoConnect"
				},
				{
					"Source": {
						"Text": "Power Auto-Connect:"
					},
					"Translation": {
						"Text": "Авто-з'єднання живлення:"
					},
					"Key": "Panel_AC_PowerEnabled"
				},
				{
					"Source": {
						"Text": "Power Poles"
					},
					"Translation": {
						"Text": "Електростовп"
					},
					"Key": "Family_PowerPole"
				},
				{
					"Source": {
						"Text": "Power Towers"
					},
					"Translation": {
						"Text": "Опора ЛЕП"
					},
					"Key": "Family_Tower"
				},
				{
					"Source": {
						"Text": "Press Scan to find upgradeable items"
					},
					"Translation": {
						"Text": "Натисніть Сканування для пошуку елементів для оновлення"
					},
					"Key": "Upgrade_PressScan"
				},
				{
					"Source": {
						"Text": "Radius"
					},
					"Translation": {
						"Text": "Радіус"
					},
					"Key": "Upgrade_Tab_Radius"
				},
				{
					"Source": {
						"Text": "Radius (m):"
					},
					"Translation": {
						"Text": "Радіус (м):"
					},
					"Key": "Upgrade_RadiusLabel"
				},
				{
					"Source": {
						"Text": "Ready"
					},
					"Translation": {
						"Text": "Готово"
					},
					"Key": "Upgrade_Ready"
				},
				{
					"Source": {
						"Text": "Recipe"
					},
					"Translation": {
						"Text": "Рецепт"
					},
					"Key": "Panel_Restore_CaptureRecipe"
				},
				{
					"Source": {
						"Text": "Recipe"
					},
					"Translation": {
						"Text": "Рецепт"
					},
					"Key": "Hint_Recipe"
				},
				{
					"Source": {
						"Text": "Recipe {0}/{1}: {2}"
					},
					"Translation": {
						"Text": "Рецепт {0}/{1}: {2}"
					},
					"Key": "HUD_Recipe"
				},
				{
					"Source": {
						"Text": "Recipe {0}/{1}: {2}"
					},
					"Translation": {
						"Text": "Рецепт {0}/{1}: {2}"
					},
					"Key": "Panel_Recipe"
				},
				{
					"Source": {
						"Text": "Recipe* {0}/{1}: {2}"
					},
					"Translation": {
						"Text": "Рецепт* {0}/{1}: {2}"
					},
					"Key": "Panel_Recipe_Active"
				},
				{
					"Source": {
						"Text": "Recipe* {0}/{1}: {2}"
					},
					"Translation": {
						"Text": "Рецепт* {0}/{1}: {2}"
					},
					"Key": "HUD_RecipeActive"
				},
				{
					"Source": {
						"Text": "Recipes"
					},
					"Translation": {
						"Text": "Рецепти"
					},
					"Key": "Panel_RecipeHeader"
				},
				{
					"Source": {
						"Text": "Reserved:"
					},
					"Translation": {
						"Text": "Зарезервовано:"
					},
					"Key": "Panel_AC_Reserved"
				},
				{
					"Source": {
						"Text": "Reset"
					},
					"Translation": {
						"Text": "Скинути"
					},
					"Key": "Panel_Btn_Reset"
				},
				{
					"Source": {
						"Text": "Rise m"
					},
					"Translation": {
						"Text": "Підйом м"
					},
					"Key": "Walk_Col_Rise"
				},
				{
					"Source": {
						"Text": "Rise{0}: {1}m"
					},
					"Translation": {
						"Text": "Підйом{0}: {1}м"
					},
					"Key": "HUD_WalkRise"
				},
				{
					"Source": {
						"Text": "Rotation"
					},
					"Translation": {
						"Text": "Обертання"
					},
					"Key": "Panel_Restore_CaptureRotation"
				},
				{
					"Source": {
						"Text": "Rotation"
					},
					"Translation": {
						"Text": "Обертання"
					},
					"Key": "Hint_Rotation"
				},
				{
					"Source": {
						"Text": "Rotation"
					},
					"Translation": {
						"Text": "Обертання"
					},
					"Key": "Panel_Section_Rotation"
				},
				{
					"Source": {
						"Text": "Rotation [Z]:"
					},
					"Translation": {
						"Text": "Обертання [Z]:"
					},
					"Key": "Panel_RotationZ"
				},
				{
					"Source": {
						"Text": "Rotation [Z]{0}: {1}°"
					},
					"Translation": {
						"Text": "Обертання [Z]{0}: {1}°"
					},
					"Key": "HUD_RotationZ"
				},
				{
					"Source": {
						"Text": "Rotation [Z]{0}: {1}° (R={2}m, {3}/circle)"
					},
					"Translation": {
						"Text": "Обертання [Z]{0}: {1}° (R={2}м, {3}/коло)"
					},
					"Key": "HUD_RotationZFull"
				},
				{
					"Source": {
						"Text": "Rotation*: 0.0°"
					},
					"Translation": {
						"Text": "Обертання*: 0.0°"
					},
					"Key": "HUD_RotationDefault"
				},
				{
					"Source": {
						"Text": "Routing"
					},
					"Translation": {
						"Text": "Маршрутизація"
					},
					"Key": "Walk_Lbl_Routing"
				},
				{
					"Source": {
						"Text": "Routing:"
					},
					"Translation": {
						"Text": "Маршрутизація:"
					},
					"Key": "Panel_AC_Routing"
				},
				{
					"Source": {
						"Text": "SMART!"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "HUD_Header"
				},
				{
					"Source": {
						"Text": "Save Current"
					},
					"Translation": {
						"Text": "Зберегти поточне"
					},
					"Key": "Panel_Btn_SavePreset"
				},
				{
					"Source": {
						"Text": "Scale X"
					},
					"Translation": {
						"Text": "Масштаб X"
					},
					"Key": "Hint_ScaleX"
				},
				{
					"Source": {
						"Text": "Scale Y"
					},
					"Translation": {
						"Text": "Масштаб Y"
					},
					"Key": "Hint_ScaleY"
				},
				{
					"Source": {
						"Text": "Scale Z"
					},
					"Translation": {
						"Text": "Масштаб Z"
					},
					"Key": "Hint_ScaleZ"
				},
				{
					"Source": {
						"Text": "Scan"
					},
					"Translation": {
						"Text": "Сканування"
					},
					"Key": "Upgrade_Btn_Scan"
				},
				{
					"Source": {
						"Text": "Scan Network"
					},
					"Translation": {
						"Text": "Сканувати мережу"
					},
					"Key": "Upgrade_Btn_ScanNetwork"
				},
				{
					"Source": {
						"Text": "Scan failed: {0}"
					},
					"Translation": {
						"Text": "Сканування не вдалося: {0}"
					},
					"Key": "Upgrade_ScanFailed"
				},
				{
					"Source": {
						"Text": "Scan network to see costs"
					},
					"Translation": {
						"Text": "Скануйте мережу для перегляду витрат"
					},
					"Key": "Upgrade_ScanCosts"
				},
				{
					"Source": {
						"Text": "Scanning network..."
					},
					"Translation": {
						"Text": "Сканування мережі..."
					},
					"Key": "Upgrade_Scanning"
				},
				{
					"Source": {
						"Text": "Select a family to see costs"
					},
					"Translation": {
						"Text": "Виберіть сімейство для перегляду витрат"
					},
					"Key": "Upgrade_SelectFamily"
				},
				{
					"Source": {
						"Text": "Select a row first to upgrade"
					},
					"Translation": {
						"Text": "Спочатку виберіть рядок для оновлення"
					},
					"Key": "Upgrade_SelectRow"
				},
				{
					"Source": {
						"Text": "Select a target tier from the dropdown"
					},
					"Translation": {
						"Text": "Виберіть цільовий рівень зі списку"
					},
					"Key": "Upgrade_SelectTier"
				},
				{
					"Source": {
						"Text": "Select target tier"
					},
					"Translation": {
						"Text": "Виберіть цільовий рівень"
					},
					"Key": "Upgrade_SelectTargetTier"
				},
				{
					"Source": {
						"Text": "Selected Preset:"
					},
					"Translation": {
						"Text": "Вибраний пресет:"
					},
					"Key": "Panel_Restore_SelectPreset"
				},
				{
					"Source": {
						"Text": "Set radius and press Scan to find items"
					},
					"Translation": {
						"Text": "Встановіть радіус і натисніть Сканування для пошуку елементів"
					},
					"Key": "Upgrade_SetRadiusScan"
				},
				{
					"Source": {
						"Text": "Settings: {0}"
					},
					"Translation": {
						"Text": "Налаштування: {0}"
					},
					"Key": "HUD_Settings"
				},
				{
					"Source": {
						"Text": "Settings: {0}*"
					},
					"Translation": {
						"Text": "Налаштування: {0}*"
					},
					"Key": "HUD_SettingsCurrent"
				},
				{
					"Source": {
						"Text": "Settings: {0}{1}"
					},
					"Translation": {
						"Text": "Налаштування: {0}{1}"
					},
					"Key": "HUD_SettingsActive"
				},
				{
					"Source": {
						"Text": "Shift m"
					},
					"Translation": {
						"Text": "Зсув м"
					},
					"Key": "Walk_Col_Shift"
				},
				{
					"Source": {
						"Text": "Shift{0}: {1}m"
					},
					"Translation": {
						"Text": "Зсув{0}: {1}м"
					},
					"Key": "HUD_WalkShift"
				},
				{
					"Source": {
						"Text": "Show Direction Arrows"
					},
					"Translation": {
						"Text": "Показати стрілки напрямку"
					},
					"Key": "P.bShowArrows"
				},
				{
					"Source": {
						"Text": "Show HUD Overlay"
					},
					"Translation": {
						"Text": "Показати HUD"
					},
					"Key": "P.bShowHUD"
				},
				{
					"Source": {
						"Text": "Show HUD Overlay"
					},
					"Translation": {
						"Text": "Показати HUD"
					},
					"Key": "Config_ShowHUD"
				},
				{
					"Source": {
						"Text": "Show X/Y/Z axis labels on the direction arrows."
					},
					"Translation": {
						"Text": "Показувати мітки осей X/Y/Z на стрілках напрямку."
					},
					"Key": "P.bShowArrowLabels.TT"
				},
				{
					"Source": {
						"Text": "Show X/Y/Z direction arrows on the building hologram."
					},
					"Translation": {
						"Text": "Показувати стрілки напрямку X/Y/Z на голограмі будівлі."
					},
					"Key": "P.bShowArrows.TT"
				},
				{
					"Source": {
						"Text": "Show a flow-direction indicator on auto-connected pipes."
					},
					"Translation": {
						"Text": "Показувати індикатор напрямку потоку на авто-з'єднаних трубах."
					},
					"Key": "P.PipeIndicator.TT"
				},
				{
					"Source": {
						"Text": "Show the Smart! overlay (grid, scale, and recipe info) while building."
					},
					"Translation": {
						"Text": "Показувати накладання Smart! (сітка, масштаб та інформація про рецепт) під час будівництва."
					},
					"Key": "P.bShowHUD.TT"
				},
				{
					"Source": {
						"Text": "Size of the Smart! HUD overlay."
					},
					"Translation": {
						"Text": "Розмір накладання Smart! HUD."
					},
					"Key": "P.HUDScale.TT"
				},
				{
					"Source": {
						"Text": "Smart Panel"
					},
					"Translation": {
						"Text": "Smart Панель"
					},
					"Key": "Hint_SmartPanel"
				},
				{
					"Source": {
						"Text": "Smart Restore"
					},
					"Translation": {
						"Text": "Smart Відновлення"
					},
					"Key": "Panel_Section_Presets"
				},
				{
					"Source": {
						"Text": "Smart Walking"
					},
					"Translation": {
						"Text": "Smart Прохід"
					},
					"Key": "Panel_Btn_SmartWalking"
				},
				{
					"Source": {
						"Text": "Smart!"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Config.Root.Name"
				},
				{
					"Source": {
						"Text": "Smart!"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Config.DisplayName"
				},
				{
					"Source": {
						"Text": "Smart! Extend"
					},
					"Translation": {
						"Text": "Smart! Розширення"
					},
					"Key": "Panel_Title_Extend"
				},
				{
					"Source": {
						"Text": "Smart! Foundations settings."
					},
					"Translation": {
						"Text": "Налаштування Smart! Foundations."
					},
					"Key": "Config.Description"
				},
				{
					"Source": {
						"Text": "Smart! Foundations settings."
					},
					"Translation": {
						"Text": "Налаштування Smart! Foundations."
					},
					"Key": "Config.Root.Tooltip"
				},
				{
					"Source": {
						"Text": "Smart! Panel"
					},
					"Translation": {
						"Text": "Smart! Панель"
					},
					"Key": "Panel_Title"
				},
				{
					"Source": {
						"Text": "Smart! Upgrade Panel"
					},
					"Translation": {
						"Text": "Smart! Панель оновлення"
					},
					"Key": "Upgrade_Title"
				},
				{
					"Source": {
						"Text": "Spacing"
					},
					"Translation": {
						"Text": "Відстань"
					},
					"Key": "Panel_Restore_CaptureSpacing"
				},
				{
					"Source": {
						"Text": "Spacing"
					},
					"Translation": {
						"Text": "Відстань"
					},
					"Key": "Panel_Section_Spacing"
				},
				{
					"Source": {
						"Text": "Spacing"
					},
					"Translation": {
						"Text": "Відстань"
					},
					"Key": "Hint_Spacing"
				},
				{
					"Source": {
						"Text": "Spacing [X]:"
					},
					"Translation": {
						"Text": "Відстань [X]:"
					},
					"Key": "Panel_SpacingX"
				},
				{
					"Source": {
						"Text": "Spacing [X]{0}: {1}m"
					},
					"Translation": {
						"Text": "Відстань [X]{0}: {1}м"
					},
					"Key": "HUD_SpacingX"
				},
				{
					"Source": {
						"Text": "Spacing [Y]:"
					},
					"Translation": {
						"Text": "Відстань [Y]:"
					},
					"Key": "Panel_SpacingY"
				},
				{
					"Source": {
						"Text": "Spacing [Y]{0}: {1}m"
					},
					"Translation": {
						"Text": "Відстань [Y]{0}: {1}м"
					},
					"Key": "HUD_SpacingY"
				},
				{
					"Source": {
						"Text": "Spacing [Z]:"
					},
					"Translation": {
						"Text": "Відстань [Z]:"
					},
					"Key": "Panel_SpacingZ"
				},
				{
					"Source": {
						"Text": "Spacing [Z]{0}: {1}m"
					},
					"Translation": {
						"Text": "Відстань [Z]{0}: {1}м"
					},
					"Key": "HUD_SpacingZ"
				},
				{
					"Source": {
						"Text": "Spacing*: 0.0m"
					},
					"Translation": {
						"Text": "Відстань*: 0.0м"
					},
					"Key": "HUD_SpacingDefault"
				},
				{
					"Source": {
						"Text": "Stackable Belt Auto-Connect"
					},
					"Translation": {
						"Text": "Авто-з'єднання складних стрічок"
					},
					"Key": "P.bStackableBeltEnabled"
				},
				{
					"Source": {
						"Text": "Stackable Belt Auto-Connect"
					},
					"Translation": {
						"Text": "Авто-з'єднання складних стрічок"
					},
					"Key": "Config_StackableBelt"
				},
				{
					"Source": {
						"Text": "Stagger"
					},
					"Translation": {
						"Text": "Зміщення"
					},
					"Key": "Panel_Restore_CaptureStagger"
				},
				{
					"Source": {
						"Text": "Stagger"
					},
					"Translation": {
						"Text": "Зміщення"
					},
					"Key": "Hint_Stagger"
				},
				{
					"Source": {
						"Text": "Stagger"
					},
					"Translation": {
						"Text": "Зміщення"
					},
					"Key": "Panel_Section_Stagger"
				},
				{
					"Source": {
						"Text": "Stagger [X]:"
					},
					"Translation": {
						"Text": "Зміщення [X]:"
					},
					"Key": "Panel_StaggerX"
				},
				{
					"Source": {
						"Text": "Stagger [X]{0}: {1}m sideways"
					},
					"Translation": {
						"Text": "Зміщення [X]{0}: {1}м вбік"
					},
					"Key": "HUD_StaggerX"
				},
				{
					"Source": {
						"Text": "Stagger [Y]:"
					},
					"Translation": {
						"Text": "Зміщення [Y]:"
					},
					"Key": "Panel_StaggerY"
				},
				{
					"Source": {
						"Text": "Stagger [Y]{0}: {1}m forward"
					},
					"Translation": {
						"Text": "Зміщення [Y]{0}: {1}м вперед"
					},
					"Key": "HUD_StaggerY"
				},
				{
					"Source": {
						"Text": "Stagger [ZX]:"
					},
					"Translation": {
						"Text": "Зміщення [ZX]:"
					},
					"Key": "Panel_StaggerZX"
				},
				{
					"Source": {
						"Text": "Stagger [ZX]{0}: {1}m lean forward"
					},
					"Translation": {
						"Text": "Зміщення [ZX]{0}: {1}м зсув вперед"
					},
					"Key": "HUD_StaggerZX"
				},
				{
					"Source": {
						"Text": "Stagger [ZY]:"
					},
					"Translation": {
						"Text": "Зміщення [ZY]:"
					},
					"Key": "Panel_StaggerZY"
				},
				{
					"Source": {
						"Text": "Stagger [ZY]{0}: {1}m lean sideways"
					},
					"Translation": {
						"Text": "Зміщення [ZY]{0}: {1}м зсув вбік"
					},
					"Key": "HUD_StaggerZY"
				},
				{
					"Source": {
						"Text": "Stagger*: 0.0m"
					},
					"Translation": {
						"Text": "Зміщення*: 0.0м"
					},
					"Key": "HUD_StaggerDefault"
				},
				{
					"Source": {
						"Text": "Steps"
					},
					"Translation": {
						"Text": "Сходинки"
					},
					"Key": "Hint_Steps"
				},
				{
					"Source": {
						"Text": "Steps"
					},
					"Translation": {
						"Text": "Сходинки"
					},
					"Key": "Panel_Restore_CaptureSteps"
				},
				{
					"Source": {
						"Text": "Steps"
					},
					"Translation": {
						"Text": "Сходинки"
					},
					"Key": "Panel_Section_Steps"
				},
				{
					"Source": {
						"Text": "Steps [X]:"
					},
					"Translation": {
						"Text": "Сходинки [X]:"
					},
					"Key": "Panel_StepsX"
				},
				{
					"Source": {
						"Text": "Steps [X]{0}: {1}m columns"
					},
					"Translation": {
						"Text": "Сходинки [X]{0}: {1}м стовпці"
					},
					"Key": "HUD_StepsX"
				},
				{
					"Source": {
						"Text": "Steps [Y]:"
					},
					"Translation": {
						"Text": "Сходинки [Y]:"
					},
					"Key": "Panel_StepsY"
				},
				{
					"Source": {
						"Text": "Steps [Y]{0}: {1}m rows"
					},
					"Translation": {
						"Text": "Сходинки [Y]{0}: {1}м рядки"
					},
					"Key": "HUD_StepsY"
				},
				{
					"Source": {
						"Text": "Steps*: 0.0m"
					},
					"Translation": {
						"Text": "Сходинки*: 0.0м"
					},
					"Key": "HUD_StepsDefault"
				},
				{
					"Source": {
						"Text": "Straight"
					},
					"Translation": {
						"Text": "Пряма"
					},
					"Key": "Walk_Opt_Straight"
				},
				{
					"Source": {
						"Text": "Target Tier:"
					},
					"Translation": {
						"Text": "Цільовий рівень:"
					},
					"Key": "Upgrade_TargetTier"
				},
				{
					"Source": {
						"Text": "Target is not upgradeable - aim at a belt, pipe, or power pole"
					},
					"Translation": {
						"Text": "Ціль не можна оновити - наведіть на стрічку, трубу або електростовп"
					},
					"Key": "Upgrade_NotUpgradeable"
				},
				{
					"Source": {
						"Text": "The on-screen Smart! overlay shown while you build."
					},
					"Translation": {
						"Text": "Екранне накладання Smart!, що показується під час будівництва."
					},
					"Key": "Sec.HUD.TT"
				},
				{
					"Source": {
						"Text": "Tier"
					},
					"Translation": {
						"Text": "Рівень"
					},
					"Key": "Walk_Lbl_Tier"
				},
				{
					"Source": {
						"Text": "To Building"
					},
					"Translation": {
						"Text": "До будівлі"
					},
					"Key": "P.PipeLevelToBuilding"
				},
				{
					"Source": {
						"Text": "To Building:"
					},
					"Translation": {
						"Text": "До будівлі:"
					},
					"Key": "Panel_AC_ToBuilding"
				},
				{
					"Source": {
						"Text": "To Building:"
					},
					"Translation": {
						"Text": "До будівлі:"
					},
					"Key": "Config_PipeToBuilding"
				},
				{
					"Source": {
						"Text": "Turn"
					},
					"Translation": {
						"Text": "Поворот"
					},
					"Key": "Walk_Col_Turn"
				},
				{
					"Source": {
						"Text": "Turn{0}: {1}°"
					},
					"Translation": {
						"Text": "Поворот{0}: {1}°"
					},
					"Key": "HUD_WalkTurn"
				},
				{
					"Source": {
						"Text": "UPGRADE"
					},
					"Translation": {
						"Text": "ОНОВИТИ"
					},
					"Key": "Upgrade_Btn_Upgrade"
				},
				{
					"Source": {
						"Text": "Unknown"
					},
					"Translation": {
						"Text": "Невідомо"
					},
					"Key": "Family_Unknown"
				},
				{
					"Source": {
						"Text": "Update"
					},
					"Translation": {
						"Text": "Оновити"
					},
					"Key": "Panel_Btn_UpdatePreset"
				},
				{
					"Source": {
						"Text": "Upgrade Panel"
					},
					"Translation": {
						"Text": "Панель оновлення"
					},
					"Key": "Hint_UpgradePanel"
				},
				{
					"Source": {
						"Text": "Upgrade cancelled: {0}/{1} completed"
					},
					"Translation": {
						"Text": "Оновлення скасовано: {0}/{1} завершено"
					},
					"Key": "Upgrade_Cancelled"
				},
				{
					"Source": {
						"Text": "Upgrade complete: {0} success, {1} failed, {2} skipped"
					},
					"Translation": {
						"Text": "Оновлення завершено: {0} успішно, {1} невдало, {2} пропущено"
					},
					"Key": "Upgrade_Complete"
				},
				{
					"Source": {
						"Text": "Upgrading {0} Mk.{1} → Mk.{2}..."
					},
					"Translation": {
						"Text": "Оновлення {0} Mk.{1} → Mk.{2}..."
					},
					"Key": "Upgrade_Upgrading"
				},
				{
					"Source": {
						"Text": "Upgrading... {0}/{1} ({2}%)"
					},
					"Translation": {
						"Text": "Оновлення... {0}/{1} ({2}%)"
					},
					"Key": "Upgrade_ProgressCount"
				},
				{
					"Source": {
						"Text": "Use Manifold Lane Belts"
					},
					"Translation": {
						"Text": "Використання стрічок колектора"
					},
					"Key": "P.bAutoConnectDistributors"
				},
				{
					"Source": {
						"Text": "Use Manifold Lane Belts:"
					},
					"Translation": {
						"Text": "Використання стрічок колектора:"
					},
					"Key": "Config_ManifoldLaneBelts"
				},
				{
					"Source": {
						"Text": "Vertical position of the HUD on screen (0 = top, 1 = bottom)."
					},
					"Translation": {
						"Text": "Вертикальна позиція HUD на екрані (0 = вгорі, 1 = внизу)."
					},
					"Key": "P.HUDPositionY.TT"
				},
				{
					"Source": {
						"Text": "Wall Outlet Mk.{0}"
					},
					"Translation": {
						"Text": "Настінна розетка Mk.{0}"
					},
					"Key": "UpgradeRow_WallOutlet"
				},
				{
					"Source": {
						"Text": "Wall Outlets (Double)"
					},
					"Translation": {
						"Text": "Розетки (подвійні)"
					},
					"Key": "Family_WallOutletDouble"
				},
				{
					"Source": {
						"Text": "Wall Outlets (Single)"
					},
					"Translation": {
						"Text": "Розетки (одинарні)"
					},
					"Key": "Family_WallOutletSingle"
				},
				{
					"Source": {
						"Text": "When you Extend a factory that has no power pole and no existing daisy link (starting a fresh manifold), wire the new buildings together with daisy-chain power. Factories already daisy-chained are always continued regardless of this option."
					},
					"Translation": {
						"Text": "Коли ви Розширюєте завод без електростовпа і без наявного послідовного зв'язку (починаючи новий колектор), з'єднуйте нові будівлі між собою послідовним живленням. Заводи, які вже з'єднані послідовно, завжди продовжуються незалежно від цього параметра."
					},
					"Key": "P.bExtendDaisyChainPoleless.TT"
				},
				{
					"Source": {
						"Text": "Which directions power poles connect: Auto, X only, Y only, or both X and Y."
					},
					"Translation": {
						"Text": "Напрямки з'єднання електростовпів: Авто, тільки X, тільки Y або X і Y."
					},
					"Key": "P.PowerConnectMode.TT"
				},
				{
					"Source": {
						"Text": "X"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Upgrade_Btn_X"
				},
				{
					"Source": {
						"Text": "X"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ArrowLabel_X"
				},
				{
					"Source": {
						"Text": "Y"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ArrowLabel_Y"
				},
				{
					"Source": {
						"Text": "You are about to generate {0} holograms.\n\nThis may cause a temporary freeze.\n\nContinue?"
					},
					"Translation": {
						"Text": "Ви збираєтесь створити {0} голограм.\\n\\nЦе може спричинити тимчасове зависання.\\n\\nПродовжити?"
					},
					"Key": "Panel_Confirm_LargeMsg"
				},
				{
					"Source": {
						"Text": "You are about to generate {0} holograms.\n\nThis will likely cause a significant freeze and may crash the game.\n\nAre you sure you want to continue?"
					},
					"Translation": {
						"Text": "Ви збираєтесь створити {0} голограм.\\n\\nЦе ймовірно спричинить значне зависання і може призвести до збою гри.\\n\\nВи впевнені?"
					},
					"Key": "Panel_Confirm_ExtremeMsg"
				},
				{
					"Source": {
						"Text": "Z"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ArrowLabel_Z"
				},
				{
					"Source": {
						"Text": "[INVALID]"
					},
					"Translation": {
						"Text": "[НЕДІЙСНЕ]"
					},
					"Key": "HUD_Invalid"
				},
				{
					"Source": {
						"Text": "apply immediately"
					},
					"Translation": {
						"Text": "застосувати негайно"
					},
					"Key": "Walk_ApplyImmediately"
				},
				{
					"Source": {
						"Text": "belt"
					},
					"Translation": {
						"Text": "стрічка"
					},
					"Key": "HUD_Walk_Belt"
				},
				{
					"Source": {
						"Text": "m"
					},
					"Translation": {
						"Text": "м"
					},
					"Key": "Panel_Unit_Meters"
				},
				{
					"Source": {
						"Text": "pipe"
					},
					"Translation": {
						"Text": "труба"
					},
					"Key": "HUD_Walk_Pipe"
				},
				{
					"Source": {
						"Text": "segment {0} too long ({1}m > 56m)"
					},
					"Translation": {
						"Text": "сегмент {0} задовгий ({1}м > 56м)"
					},
					"Key": "Walk_Invalid_TooLong"
				},
				{
					"Source": {
						"Text": "segment {0} too steep ({1}deg > 30deg)"
					},
					"Translation": {
						"Text": "сегмент {0} закрутий ({1}° > 30°)"
					},
					"Key": "Walk_Invalid_TooSteep"
				},
				{
					"Source": {
						"Text": "{0} Mk.{1}: No valid upgrade target selected"
					},
					"Translation": {
						"Text": "{0} Mk.{1}: Не вибрано дійсну ціль для оновлення"
					},
					"Key": "Upgrade_NoValidTarget"
				},
				{
					"Source": {
						"Text": "{0} [LIMIT HIT]"
					},
					"Translation": {
						"Text": "{0} [ДОСЯГНУТО ЛІМІТ]"
					},
					"Key": "Upgrade_FoundItemsLimit"
				},
				{
					"Source": {
						"Text": "{0} items → Mk.{1}\n"
					},
					"Translation": {
						"Text": "{0} елементів → Mk.{1}\\n"
					},
					"Key": "Upgrade_CostItems"
				},
				{
					"Source": {
						"Text": "{0} {0}|plural(one=segment,other=segments)  ·  head {1} {2} deg  ·  {3}"
					},
					"Translation": {
						"Text": "{0} {0}|plural(one=сегмент,few=сегменти,many=сегментів,other=сегмента)  ·  курс {1} {2} °  ·  {3}"
					},
					"Key": "Walk_Summary"
				},
				{
					"Source": {
						"Text": "{0} × {1} Mk.{2} → Mk.{3}\n"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Upgrade_CostHeader"
				},
				{
					"Source": {
						"Text": "{0} × {1} Mk.{2} → Mk.{3}\n(Cost unavailable)"
					},
					"Translation": {
						"Text": "{0} × {1} Mk.{2} → Mk.{3}\\n(Вартість недоступна)"
					},
					"Key": "Upgrade_CostUnavailable"
				},
				{
					"Source": {
						"Text": "‹ Scaling"
					},
					"Translation": {
						"Text": "‹ Масштабування"
					},
					"Key": "Walk_Btn_Scaling"
				},
				{
					"Source": {
						"Text": "← Input: {0} x{1} ({2}/min) (Grid Total: {3}/min)"
					},
					"Translation": {
						"Text": "← Вхід: {0} x{1} ({2}/хв) (Всього: {3}/хв)"
					},
					"Key": "Panel_Recipe_Input"
				},
				{
					"Source": {
						"Text": "← Input: {0} x{1} m³ ({2}/min) (Grid Total: {3}/min)"
					},
					"Translation": {
						"Text": "← Вхід: {0} x{1} м³ ({2}/хв) (Всього: {3}/хв)"
					},
					"Key": "Panel_Recipe_InputLiquid"
				},
				{
					"Source": {
						"Text": "→ Output: {0} x{1} ({2}/min) (Grid Total: {3}/min)"
					},
					"Translation": {
						"Text": "→ Вихід: {0} x{1} ({2}/хв) (Всього: {3}/хв)"
					},
					"Key": "Panel_Recipe_Output"
				},
				{
					"Source": {
						"Text": "→ Output: {0} x{1} m³ ({2}/min) (Grid Total: {3}/min)"
					},
					"Translation": {
						"Text": "→ Вихід: {0} x{1} м³ ({2}/хв) (Всього: {3}/хв)"
					},
					"Key": "Panel_Recipe_OutputLiquid"
				}
			]
		}
	]
}